[
  {
    "model": "news.tag",
    "pk": 1,
    "fields": {
      "name": "Политика",
      "slug": "politika"
    }
  },
  {
    "model": "news.tag",
    "pk": 2,
    "fields": {
      "name": "Спорт",
      "slug": "sport"
    }
  },
  {
    "model": "news.tag",
    "pk": 3,
    "fields": {
      "name": "Культура",
      "slug": "kultura"
    }
  },
  {
    "model": "news.tag",
    "pk": 4,
    "fields": {
      "name": "Технологии",
      "slug": "tekhnologii"
    }
  },
  {
    "model": "news.tag",
    "pk": 5,
    "fields": {
      "name": "Наука",
      "slug": "nauka"
    }
  },
  {
    "model": "news.tag",
    "pk": 6,
    "fields": {
      "name": "Экономика",
      "slug": "ekonomika"
    }
  },
  {
    "model": "news.tag",
    "pk": 7,
    "fields": {
      "name": "Образование",
      "slug": "obrazovanie"
    }
  },
  {
    "model": "news.tag",
    "pk": 8,
    "fields": {
      "name": "Здоровье",
      "slug": "zdorove"
    }
  },
  {
    "model": "news.tag",
    "pk": 9,
    "fields": {
      "name": "Путешествия",
      "slug": "puteshestviya"
    }
  },
  {
    "model": "news.tag",
    "pk": 10,
    "fields": {
      "name": "Мода",
      "slug": "moda"
    }
  },
  {
    "model": "news.tag",
    "pk": 11,
    "fields": {
      "name": "Искусство",
      "slug": "iskusstvo"
    }
  },
  {
    "model": "news.tag",
    "pk": 12,
    "fields": {
      "name": "Музыка",
      "slug": "muzyka"
    }
  },
  {
    "model": "news.tag",
    "pk": 13,
    "fields": {
      "name": "Кино",
      "slug": "kino"
    }
  },
  {
    "model": "news.tag",
    "pk": 14,
    "fields": {
      "name": "Литература",
      "slug": "literatura"
    }
  },
  {
    "model": "news.tag",
    "pk": 15,
    "fields": {
      "name": "Кулинария",
      "slug": "kulinariya"
    }
  },
  {
    "model": "news.tag",
    "pk": 16,
    "fields": {
      "name": "Автомобили",
      "slug": "avtomobili"
    }
  },
  {
    "model": "news.tag",
    "pk": 17,
    "fields": {
      "name": "Фитнес",
      "slug": "fitnes"
    }
  },
  {
    "model": "news.tag",
    "pk": 18,
    "fields": {
      "name": "Красота",
      "slug": "krasota"
    }
  },
  {
    "model": "news.tag",
    "pk": 19,
    "fields": {
      "name": "Психология",
      "slug": "psikhologiya"
    }
  },
  {
    "model": "news.tag",
    "pk": 20,
    "fields": {
      "name": "Социальные медиа",
      "slug": "sotsialnye-media"
    }
  },
  {
    "model": "news.tag",
    "pk": 21,
    "fields": {
      "name": "Игры",
      "slug": "igry"
    }
  },
  {
    "model": "news.tag",
    "pk": 22,
    "fields": {
      "name": "Фотография",
      "slug": "fotografiya"
    }
  },
  {
    "model": "news.tag",
    "pk": 23,
    "fields": {
      "name": "Дизайн",
      "slug": "dizayn"
    }
  },
  {
    "model": "news.tag",
    "pk": 24,
    "fields": {
      "name": "Архитектура",
      "slug": "arkhitektura"
    }
  },
  {
    "model": "news.tag",
    "pk": 25,
    "fields": {
      "name": "История",
      "slug": "istoriya"
    }
  },
  {
    "model": "news.tag",
    "pk": 26,
    "fields": {
      "name": "Экология",
      "slug": "ekologiya"
    }
  },
  {
    "model": "news.tag",
    "pk": 27,
    "fields": {
      "name": "Международные отношения",
      "slug": "mezhdunarodnye-otnosheniya"
    }
  },
  {
    "model": "news.tag",
    "pk": 28,
    "fields": {
      "name": "Криминал",
      "slug": "kriminal"
    }
  },
  {
    "model": "news.tag",
    "pk": 29,
    "fields": {
      "name": "Театр",
      "slug": "teatr"
    }
  },
  {
    "model": "news.tag",
    "pk": 30,
    "fields": {
      "name": "Животные",
      "slug": "zhivotnye"
    }
  },
  {
    "model": "news.tag",
    "pk": 31,
    "fields": {
      "name": "Искусственный интеллект",
      "slug": "iskusstvennyy-intellekt"
    }
  },
  {
    "model": "news.tag",
    "pk": 33,
    "fields": {
      "name": "Школа",
      "slug": "shkola"
    }
  },
  {
    "model": "news.tag",
    "pk": 34,
    "fields": {
      "name": "Опросы",
      "slug": "oprosy"
    }
  },
  {
    "model": "news.tag",
    "pk": 35,
    "fields": {
      "name": "Видео",
      "slug": "video"
    }
  },
  {
    "model": "news.tag",
    "pk": 36,
    "fields": {
      "name": "Социальные сети и сообщества",
      "slug": "sotsialnye-seti-i-soobshchestva"
    }
  },
  {
    "model": "news.tag",
    "pk": 37,
    "fields": {
      "name": "Инженерные системы",
      "slug": "inzhenernye-sistemy"
    }
  },
  {
    "model": "news.tag",
    "pk": 38,
    "fields": {
      "name": "IT-инфраструктура",
      "slug": "it-infrastruktura"
    }
  },
  {
    "model": "news.tag",
    "pk": 39,
    "fields": {
      "name": "Сетевые технологии",
      "slug": "setevye-tekhnologii"
    }
  },
  {
    "model": "news.tag",
    "pk": 40,
    "fields": {
      "name": "Сетевое оборудование",
      "slug": "setevoe-oborudovanie"
    }
  },
  {
    "model": "news.tag",
    "pk": 41,
    "fields": {
      "name": "Учебный процесс",
      "slug": "uchebnyy-protsess"
    }
  },
  {
    "model": "news.tag",
    "pk": 42,
    "fields": {
      "name": "Игры и игровые консоли",
      "slug": "igry-i-igrovye-konsoli"
    }
  },
  {
    "model": "news.tag",
    "pk": 43,
    "fields": {
      "name": "Краудсорсинг",
      "slug": "kraudsorsing"
    }
  },
  {
    "model": "news.tag",
    "pk": 44,
    "fields": {
      "name": "Дизайн мобильных приложений",
      "slug": "dizayn-mobilnykh-prilozheniy"
    }
  },
  {
    "model": "news.tag",
    "pk": 45,
    "fields": {
      "name": "Интерфейсы",
      "slug": "interfeysy"
    }
  },
  {
    "model": "news.tag",
    "pk": 46,
    "fields": {
      "name": "SQL",
      "slug": "sql"
    }
  },
  {
    "model": "news.tag",
    "pk": 47,
    "fields": {
      "name": "Бизнесс",
      "slug": "bizness"
    }
  },
  {
    "model": "news.tag",
    "pk": 48,
    "fields": {
      "name": "Ноутбуки",
      "slug": "noutbuki"
    }
  },
  {
    "model": "news.tag",
    "pk": 49,
    "fields": {
      "name": "IT-компании",
      "slug": "it-kompanii"
    }
  },
  {
    "model": "news.tag",
    "pk": 50,
    "fields": {
      "name": "Google chrome",
      "slug": "google-chrome"
    }
  },
  {
    "model": "news.tag",
    "pk": 51,
    "fields": {
      "name": "Pytorch",
      "slug": "pytorch"
    }
  },
  {
    "model": "news.tag",
    "pk": 52,
    "fields": {
      "name": "Chatgpt",
      "slug": "chatgpt"
    }
  },
  {
    "model": "news.tag",
    "pk": 53,
    "fields": {
      "name": "Python",
      "slug": "python"
    }
  },
  {
    "model": "news.tag",
    "pk": 54,
    "fields": {
      "name": "C++",
      "slug": "c-plus-plus"
    }
  },
  {
    "model": "news.tag",
    "pk": 55,
    "fields": {
      "name": "C#",
      "slug": "c-sharp"
    }
  },
  {
    "model": "news.tag",
    "pk": 56,
    "fields": {
      "name": "Django",
      "slug": "django"
    }
  },
  {
    "model": "news.tag",
    "pk": 57,
    "fields": {
      "name": "Медицина",
      "slug": "meditsina"
    }
  },
  {
    "model": "news.tag",
    "pk": 58,
    "fields": {
      "name": "Любовь",
      "slug": "lyubov"
    }
  },
  {
    "model": "news.tag",
    "pk": 59,
    "fields": {
      "name": "Люди",
      "slug": "lyudi"
    }
  },
  {
    "model": "news.tag",
    "pk": 60,
    "fields": {
      "name": "Новинки",
      "slug": "novinki"
    }
  },
  {
    "model": "news.tag",
    "pk": 61,
    "fields": {
      "name": "Стиль",
      "slug": "stil"
    }
  },
  {
    "model": "news.tag",
    "pk": 62,
    "fields": {
      "name": "Работа",
      "slug": "rabota"
    }
  },
  {
    "model": "news.tag",
    "pk": 63,
    "fields": {
      "name": "Еда",
      "slug": "eda"
    }
  },
  {
    "model": "news.tag",
    "pk": 64,
    "fields": {
      "name": "Отпуск",
      "slug": "otpusk"
    }
  },
  {
    "model": "news.tag",
    "pk": 65,
    "fields": {
      "name": "Linux",
      "slug": "linux"
    }
  },
  {
    "model": "news.tag",
    "pk": 66,
    "fields": {
      "name": "Закон",
      "slug": "zakon"
    }
  },
  {
    "model": "news.tag",
    "pk": 67,
    "fields": {
      "name": "TikTok",
      "slug": "tiktok"
    }
  },
  {
    "model": "news.tag",
    "pk": 68,
    "fields": {
      "name": "Смартфон",
      "slug": "smartfon"
    }
  },
  {
    "model": "news.tag",
    "pk": 69,
    "fields": {
      "name": "Windows",
      "slug": "windows"
    }
  },
  {
    "model": "news.tag",
    "pk": 70,
    "fields": {
      "name": "Астрология",
      "slug": "astrologiya"
    }
  },
  {
    "model": "news.tag",
    "pk": 71,
    "fields": {
      "name": "Космонавтика",
      "slug": "kosmonavtika"
    }
  },
  {
    "model": "news.news",
    "pk": 1,
    "fields": {
      "title": "OpenAI: за год число еженедельных активных пользователей компании достигло 200 млн",
      "brief": "OpenAI отчиталась, что число её еженедельных активных пользователей достигло 200 млн. Этот показатель в два раза превышает прошлогодний. Также разработчик ChatGPT указал, что его продуктами пользуются 92% крупнейших компаний из списка Fortune 500.",
      "content": "Использование автоматизированного API OpenAI удвоилось с момента выпуска модели GPT-4o mini в июле этого года.\r\n\r\nВ честь достижения 200 млн пользователей соучредитель и генеральный директор OpenAI Сэм Альтман написал, что теперь люди используют инструменты компании в своей повседневной жизни, внося реальные изменения в такие сферы, как здравоохранение и образование. По его словам, решения OpenAI нашли применение в выполнении рутинных задач, решении сложных проблем и раскрытии творческих способностей.\r\n\r\nВ ноябре прошлого года число пользователей ChatGPT достигло 100 млн, а более 2 млн разработчиков подключились к API компании.\r\n\r\nДвукратное увеличение пользовательской базы OpenAI свидетельствует о том, что тенденция развития искусственного интеллекта в технологиях продолжает расти в целом и для компании Альтмана в частности, несмотря на усилия Google, Meta*, Antropic и других, пишет Neowin.\r\n\r\nВ конце прошлого месяца Wall Street Journal сообщила, что OpenAI ведёт переговоры о привлечении нескольких миллиардов долларов. В новом раунде финансирования лидирует венчурный фонд Thrive Capital, он готовит вложить около $1 млрд. Привлечение средств позволит OpenAI увеличить свою капитализацию до 100 млрд.",
      "pub_date": "2024-09-01T14:53:27Z",
      "views": 52,
      "status": "published",
      "image": "news_images/58e0ba99430257fa1fc4df0d9d7d6295_miRfbcX.jpeg",
      "author": 1,
      "notified": false,
      "tags": [31]
    }
  },
  {
    "model": "news.news",
    "pk": 2,
    "fields": {
      "title": "Провели опрос к 1 сентября: как россияне учились в школе",
      "brief": "Многие считают, что именно за школьной скамьей человек получает одни из главных уроков в его жизни. О том, какие школьные знания пригодились россиянам во взрослой жизни и чего им не хватало во время обучения – в тематическом опросе РСХБ, проведенном ко Дню знаний.",
      "content": "По результатам опроса, 69% респондентов учились в школе на четверки и пятерки, а 17% справедливо отметили, что «тройка — тоже оценка». При этом доля круглых отличников самая маленькая – порядка 14%.\r\n\r\nПрактически поровну разделилось число любителей точных наук (47%) и гуманитариев (43%), и 10% респондентов ответили, что физкультура и труд были их любимыми предметами в школе.\r\n\r\nБольше всего в школьное время россиянам не хватало занятий по финансовой грамотности (28%). Четверть опрошенных (25%) хотели бы больше уроков, связанных с новыми технологиями и ИТ, еще 25% респондентов признались, что в школьной программе не хватало специализированных занятий для будущих профессий. 12% предпочли бы, больше занятий на свежем отдыхе и 10% отметили, что были бы не против тихого часа в перерывах между уроками.\r\n\r\nДля 43% респондентов школа стала источником базовых знаний, а 23% опрошенных признались, что приобрели важный навык грамотной речи, еще 23% получили необходимые знания для поступления в желаемый вуз. Только 11% отметили, что занятия помогли им понять, кем они хотят стать в будущем.\r\n\r\n76% опрошенных россиян поделились, что их текущая профессия не совпадает с той, о которой они мечтали в школьные годы, и только 24% респондентов сейчас работают по той специальности, которую выбрали для себя еще в детстве.\r\n\r\nНа вопрос, поддерживаете ли вы раннюю профориентацию, 46% респондентов ответили, что такие уроки могут стать залогом будущего карьерного успеха, а 21% сказали, что они необходимы лишь для некоторых отраслей. 18% опрошенных придерживаются позиции, что ребенок не способен определиться с будущей карьерой в таком раннем возрасте, 15% воздержались от ответа.",
      "pub_date": "2024-09-02T14:54:29Z",
      "views": 27,
      "status": "published",
      "image": "news_images/ad30b02b50f627a1b20a85653a15a59c.jpg",
      "author": 1,
      "notified": false,
      "tags": [33, 34]
    }
  },
  {
    "model": "news.news",
    "pk": 3,
    "fields": {
      "title": "Пользователи «VK Видео» смогут привязать клипы к горизонтальным роликам",
      "brief": "«VK Видео» представила новую функцию. Автор может прикрепить короткий ролик к длинному видео в режиме редактирования на экране загрузки.",
      "content": "«VK Видео» представила новую функцию. Автор может прикрепить короткий ролик к длинному видео в режиме редактирования на экране загрузки. Появилась кнопка «Привязать клип», которая позволяет выбрать до трёх коротких видео. Функция доступна и для опубликованного контента через кнопку «Редактировать». Объединять можно только свой собственный контент.\r\n\r\nПосле привязки клипа к горизонтальному видео в описании короткого ролика появится кнопка, позволяющая перейти к полной версии. Зритель сможет нажать на неё и посмотреть длинный ролик.\r\n\r\nПри необходимости видео можно отвязать в любой момент на экране редактирования. Если прикреплённое горизонтальное видео будет удалено, ссылка на него в клипе исчезнет.\r\n\r\nНовый инструмент даёт авторам возможность расширить дистрибуцию контента, улучшить взаимодействие с аудиторией и продвигать свои работы на дополнительной площадке. Функция доступна в веб‑версии «VK Видео», в основном приложении VK на устройствах с Android и iOS. В будущем планируется интеграция этой технологии и в мобильное приложение «VK Видео».",
      "pub_date": "2024-08-28T14:55:48Z",
      "views": 151,
      "status": "published",
      "image": "news_images/aee5bef9b39a4865c47e7e28d8285814.jpg",
      "author": 1,
      "notified": false,
      "tags": [35, 36]
    }
  },
  {
    "model": "news.news",
    "pk": 4,
    "fields": {
      "title": "Спорт, знания, комфорт: К2Тех создал комплексный ИТ-ландшафт для ведущего федерального университета",
      "brief": "К2Тех осуществил масштабный проект по созданию ИТ-ландшафта одного из ведущих федеральных университетов России: реализованы многофункциональные конференц-залы и учебные аудитории, обустроен блок для проведения спортивных соревнований, создан центр обработки данных. На территории университета развернута высокоскоростная сеть передачи данных.",
      "content": "В ходе выполнения проекта специалисты К2Тех провели технологическое оснащение студенческого комплекса, дворца спорта, медицинского центра, тренировочного поля, парковой зоны и жилых корпусов. На площади студенческого центра команда К2Тех выполнила монтаж, пуско-наладку и интеграцию 9 систем, в том числе центра обработки данных. Многофункциональный конференц-зал обеспечен 7-метровым светодиодным табло, линейными массивами звука, световой фермой и конференц-системой, что позволяет проводить не только выступления делегаций, но и концерты.\r\n\r\nК2Тех оборудовал более 30 учебных аудиторий и компьютерных классов, включая залы-трансформеры, которые позволяют проводить до 3-х независимых мероприятий в одном помещении по заранее прописанным сценариям переключения оборудования в зависимости от формата. Помимо конференц-залов инженеры обустроили спортблок для проведения матчей по мини-футболу. С этой целью они установили удароустойчивое светодиодное табло, аудиосистемы, камеры и мобильные видеостудии для прямого подключения репортеров к съемке, коммутации и иным функциям управления.\r\n\r\nЛокальные вычислительные сети, способные выдерживать повышенные нагрузки в период массовых мероприятий, были внедрены на всех объектах университета. Сеть включает три независимых сегмента: \r\n\r\nПользовательский — обеспечивает работу Wi-Fi, ТВ, мультимедийных систем.\r\n\r\nСеть безопасности — отвечает за функционирование систем видеонаблюдения, турникетов и т.д.\r\n\r\nТехнологическая сеть — гарантирует бесперебойную работу систем диспетчеризации, пожаро-охранной сигнализации и пр.\r\n\r\nВ проекте использовалось разное оборудование, в зависимости от характеристик помещений и сценариев использования сети. Так, в каждой комнате общежитий установлена точка доступа гостиничного типа: через нее работает не только Wi-Fi, но и другие системы, например, телевидение. Специальное решение разработано для парковых зон, где точки доступа размещаются на столбах освещения: они устойчивы к погодным условиям и не нарушают внешний вид паркового ансамбля. Всего на территории установлено около 500 коммутаторов и 6 000 точек доступа. Пропускная способность сети достигает 80 Гбит/с.",
      "pub_date": "2024-08-26T14:59:00Z",
      "views": 530,
      "status": "published",
      "image": "news_images/f910f1a1d806b471ddec05b41a91ab63.jpg",
      "author": 1,
      "notified": false,
      "tags": [37, 38, 39, 40]
    }
  },
  {
    "model": "news.news",
    "pk": 5,
    "fields": {
      "title": "В Центральном университете стартовал первый в истории вуза поток бакалавриата и третий поток магистратуры",
      "brief": "В Центральном университете стартовал первый в истории вуза поток бакалавриата и третий поток магистратуры. Среди 545 студентов нового набора — победители олимпиад и конкурсов из разных регионов России. Обучение будет проходить в новом кампусе в центре Москвы, рассказали Хабру в пресс-службе университета.",
      "content": "Каждый пятый студент первого потока бакалавриата — победитель или призёр Всероссийской олимпиады школьников, Национальной олимпиады по анализу данных DANO, Олимпиады по промышленной разработке PROD, Кейс‑чемпионата DEADLINE и других состязаний. Студентами Центрального университета стали не только москвичи, 60% первокурсников бакалавриата — представители 78 регионов России. Они будут обучаться на направлениях «Разработка», «Искусственный интеллект», «Бизнес и аналитика».\r\n\r\nОтбор в первый поток бакалавриата запустили в ноябре 2023 года. На протяжении десяти месяцев вуз проводил конкурс на получение гранта, а также мероприятия, позволяющие кандидатам проявить себя: нестандартные олимпиады по программированию и анализу данных, кейс‑чемпионаты по бизнесу и экономике, образовательные выезды, где абитуриенты решали бизнес‑кейсы. Абитуриентов, показавших лучшие результаты в конкурсе и мероприятиях, вознаграждили грантами на обучение в размере от 25% до 100%, которые предоставили индустриальные партнёры вуза.\r\n\r\nТретий поток магистратуры Центрального университета составляют недавние выпускники лучших вузов страны, в том числе НИУ ВШЭ, МФТИ, МГУ, ИТМО. Конкурс этого года на программы магистратуры Центрального университета составил более 20 человек на место. Многие магистранты работают в «Т‑Банке», «Авито», «Яндексе», «Озоне» и других крупных компаниях. Студенты получат углубленные специализированные знания по направлениям «Машинное обучение (ML)», «Продуктовый менеджмент», «Продуктовая аналитика» и «Бэкенд‑разработка».\r\n\r\nУчебный год пройдёт в новом кампусе Центрального университета в центре Москвы. Его спроектировали специально с учётом актуальных образовательных стандартов и потребностей студентов. Учащимся доступны 22 аудитории для семинарских занятий, 12 лекционных аудиторий, восемь переговорных комнат и коворкинг. Здание оснащено кофе‑поинтами, столовой, библиотекой и спортзалом. В дизайн‑проекте отражены современные архитектурные тенденции, а функционал направлен на комфорт и удобство.",
      "pub_date": "2024-08-01T15:00:21Z",
      "views": 707,
      "status": "published",
      "image": "news_images/58e0ba99430257fa1fc4df0d9d7d6295_1.jpeg",
      "author": 1,
      "notified": false,
      "tags": [38, 41]
    }
  },
  {
    "model": "news.news",
    "pk": 6,
    "fields": {
      "title": "Разработчики эмуляторов EmuDeck выпустят консоль EmuDeck Machines",
      "brief": "Автор популярного эмулятора EmuDeck Родриго Седано объявил о разработке собственной приставки под названием EmuDeck Machines. Это компактный компьютер на Linux, настроенный для запуска игр, в том числе через эмуляторы.",
      "content": "Седано запустил краудфандинговый проект на Indiegogo, где можно заказать новинку по цене от $331. Первые поставки начнутся в декабре этого года.\r\n\r\nУстройство будет представлено в двух конфигурациях: EM1 с чипом Intel N97 и EM2 на базе процессора AMD Ryzen 5 8600G. Версия с Intel будет предназначена для нетребовательных ретро-игр, а модель с Ryzen оснащена встроенной графикой Radeon 760M, что позволит запускать современные ААА-игры. Также консоль получит четыре порта USB спереди для дополнительных проводных контроллеров или периферийных устройств. Внешний блок питания получит мощность 155 Вт.\r\n\r\nТекущий прототип — это просто плата Mini-ITX в корпусе 8,66 x 8,66 x 2,55 дюйма, а Седано ожидает поставок консольного корпуса в форме Dreamcast от потенциальных партнёров в Испании. \r\n\r\nРазработчик говорит, что в GTA 5 EM2 демонстрирует 110 FPS, в Cyberpunk 2077 — 61 FPS, а в шутере Counter-Strike 2 — 200 FPS. Кроме того, пользователи смогут подключать внешние видеокарты (eGPU) для повышения производительности и запуска «тяжёлых» игр.\r\n\r\nПо словам Седано, партнёры из США и ЕС говорят ему, что получение сертификатов FCC и CE должно занять всего один месяц. \r\n\r\nРазработчику может не понадобиться поддержка Valve, так как он намерен использовать Bazzite, форк интерфейса SteamOS с другой базовой операционной системой (Fedora). Основатель Bazzite Кайл Господетич подтвердил, что его команда дала EmuDeck разрешение на использование дистрибутива.\r\n\r\nПервая сборка Bazzite вышла в августе 2023 года. Проект собран на базе Fedora Linux 38 и предназначен для запуска игр. Сборка поставляется вместе со всеми необходимыми драйверами. Bazzite адаптирован под Steam Deck.",
      "pub_date": "2024-08-06T15:01:55Z",
      "views": 0,
      "status": "published",
      "image": "news_images/c608304c19378d881e3c579c80992313.jpeg",
      "author": 1,
      "notified": false,
      "tags": [21, 42, 43]
    }
  },
  {
    "model": "news.news",
    "pk": 7,
    "fields": {
      "title": "Стресс-тест заказа такси через приложение Yandex Go. Сравниваем интерфейсы пяти приложений",
      "brief": "Возможно, самой слабо акцентированной и, вследствие этого, приводящей к курьезным или стрессовым ситуациям операцией является установка стартовой точки. От результата этой операции зависит, как долго вы будете с чемоданом или коляской, под палящим солнцем или дождем бегать искать такси или такси вас. Случалось ли вам, например, ставить точку старта на взлетное поле, а водитель при этом, впервые заехавший в Домодедово, пытался до нее доехать?",
      "content": "Как-то выходим нагулявшись с семьей из парка и упираемся в машину. За рулем молодая мама с плачущим малышом на коленях безуспешно пытается вырулить в узком, забитым другими авто и людьми, переулке. Воскресенье, толпа, жара, все устали. Предлагаю девушке подержать малыша у себя на руках, ибо имею опыт, она соглашается оглядывая нашу семью и диспозиция такая: мама нервно выруливает, ребенок плачет у чужого дяди на руках, парковка забита, вокруг гомон, толкотня… в общем, ад.\r\n\r\nНаконец, все разрешается, малыш возвращен маме, машина протискиваются по улочке, я достаю телефон и вызываю такси для нас. Только руки дрожат и перед глазами стоит удивленное личико ребенка. Нажимаю “заказать такси” и только через некоторое время понимаю, что поставил точку старта по геолокации, т.е. в самый эпицентр этого ада.\r\n\r\nСапсан. Соседи по вагону - юношеская команда по хоккею, тренеры по фигурному катанию обсуждают за спиной спортивные травмы. После четырех часов нескучной поездки, на выходе задевают клюшкой по голове. Пытаюсь вызвать такси, но не сразу понимаю где я и как разобраться в перегруженном деталями интерфейсе, потому что в голове туманно и немного звенит в ушах.\r\n\r\nПочему нужно так акцентироваться на внешних обстоятельствах? Потому что в этот момент внимание пользователя максимально рассеянно, взгляд цепляется только за самые выразительные детали, мозг ищет самые простые решения.\r\n\r\nЦель\r\nОценить прилагаемые усилия для установки стартовой точки, выявить проблемные места, рассмотреть альтернативные приложения и их интерфейсы.\r\n\r\nСитуация\r\nМы в новом для себя городе, отпуск, добрались из аэропорта до съемной квартиры и, немного не в себе от поездки и в предвкушении новых впечатлений, бросили вещи и заказали такси “куда-нибудь до моря”.\r\n\r\nВыходим из подъезда и обнаруживаем такси на дороге за проволочным забором ограждающим ЖК только с одной стороны. В заборе нет калитки двести метров в обе стороны… Проверяем точку старта и понимаем, что зря доверились автоматическому выбору и проглядели на карте забор. Разводим руками и лезем через забор (шутка).\r\n\r\nИспользуемое устройство\r\nAsus Zenfone 3 ZE552KL. Диагональ 5.5”. Android 8.0. 720x1280\r\n\r\nПричина выбора приложений\r\nВыйдя с чемоданом, скажем, из Ленинградского вокзала, приложив ладонь к глазам и обведя взором плещущееся желто-черно-белое море машин с эмблемой Yandex Go, путешественник, вероятно, сделаете вывод, что единственной путеводной звездой будет вышеупомянутое приложение.\r\n\r\nВ Калининградской области, например, наоборот: москвич, выйдя из аэропорта, обнаружит (если очень постарается) такси с привычной эмблемой только далеко за шлагбаумом у въезда на территорию, потому что здесь есть свое таксистское лобби, а въезд для остальных бесплатно только один раз. Поэтому, либо оформляете местное такси, либо идете пешочком до шлагбаума.\r\n\r\nПрибыв, например, в город Светлогорск, можно заметить некоторое разнообразие, есть “Максим”, “Везёт” и до недавнего времени, еще попадался логотип Uber.\r\n\r\nСитиМобил был выбран дополнительно эвристическим методом по некоторым упоминаниям в интернете. Но, в, Калининградской области, например, сервис недоступен.\r\n\r\nБудьте внимательны! Темная самбийская ночь где-то в окрестностях деревни Романово. Вы стоите посреди лесостепи после просмотра огненного шоу в реконструированном поселении викингов. Уже все разъехались и вокруг ни души, ни огонька на несколько километров, а вы упорно смотрите в приложение, но там рыбы т.е. такси нет, потому что нет интернета! В общем, я предупредил.\r\n\r\nПуть пользователя до выбора стартовой точки\r\n\r\nКак мы видим (для варианта с нажатой кнопкой “Такси”), в Yandex Go суперап и маркетинг добавляют пару экранов. Нужно отметить, что реклама появляется редко, так что, в основном, это +1 экран.\r\n\r\nВ среднем путь занимает 3 экрана, включая загрузочный и включение геолокации. Приложение “Максим” геолокацию при старте не проверяет.\r\n\r\nГлавный экран Yandex Go и варианты действий пользователя\r\nЕсли от баннера легко отмахнуться, то главный экран суперапа, на мой взгляд, головоломный.\r\n\r\nНапомним, что у нас стрессовая ситуация: мы душой и телом на море или получили клюшкой по голове от юниора в поезде или просто перегрелись на солнце в парке.\r\n\r\nНа этом экране пользователь получает новую нагрузку. Для начала, нужно проанализировать экран и выбрать правильную кнопку для перехода к заказу такси. Тут как-будто приложение идет пользователю навстречу и делает разделение кнопок по размеру и расположению. Самая крупная и ближе расположенная к большому пальцу правой руки - то, что нужно.\r\n\r\nПредположительно, здесь должен был быть выбор из двух вариантов: много маленьких второстепенных кнопок и одна большая главная, тогда задача простая и вы нажимаете на большую кнопку. Но… Этого не происходит. Немного помедлив, вы понимаете, что есть еще один вариант - кнопка выбора конечной точки “Куда едем?”. А еще предложенные варианты пунктов назначения, которые тоже нужно анализировать.\r\n\r\nТеперь задача усложняется кратно, потому что если нет простого дуального выбора, то уже их может быть три и вообще сколько угодно. И их таки оказывается три! Есть еще кнопка “Межгород”, что в контексте нашего кейса и малых близко расположенных приморских городов, например, Светлогорск, Пионерский, Зеленоградск, в принципе, бессмысленно, так как расстояния небольшие и в этих условиях такси часто подается из города назначения.\r\n\r\nДопустим, пользователь определился с тремя вариантами, откинул “Межгород” и пытается понять, какая из двух кнопок ему больше подходит. Казалось бы, нужно нажать на большую кнопку и не думать, но вторая кнопка предлагает сократить количество шагов и сразу начать с выбора конечной точки.\r\n\r\nУвы, это вовсе не дает гарантии экономии времени, так как предполагает, что точка старта установлена автоматически, а пользователь, отвлекшись на анализ кнопок, забыл, что вокруг дома снова меняют поребрик, район перекопан и точку старта надо перенести метров на 50 и ближе к дороге. Для нашего кейса, это вообще, неизвестная местность с неочевидным забором.\r\n\r\nНажав кнопку “Куда едем?”, пользователь вернется к выбору “точки старта” вспомнив о дополнительных обстоятельствах или забудет скорректировать со всеми вытекающими отсюда последствиями.\r\n\r\nНа иллюстрации изображены две основные ветви пути пользователя до экранов с полным маршрутом.\r\n\r\nСогласно диаграмме, во втором варианте кнопка “Заказать” появляется раньше на один экран. Но… В этом случае, пользователь нажимает “Заказать” на свой страх и риск, так как есть два допущения. Во-первых, точка старта, установленная автоматически, не требует коррекции. Во-вторых, пользователь не видит полного маршрута с дополнительными деталями.\r\n\r\nВывод\r\nИсходя из нашей ситуации и поставленной цели, представляется, что экран выбора точки старта в приложении СитиМобил наиболее соответствует понятию о ясном и удобном интерфейсе. Тем не менее, могут существовать другие ситуации, критерии и механики, которые позволят оспорить это заключение.\r\n\r\nПриложение для вызова такси сродни навигации в метро. В сложной внешней среде с множеством отвлекающих факторов нужно максимально быстро ориентироваться и принимать решения.",
      "pub_date": "2023-04-30T21:00:00Z",
      "views": 490,
      "status": "archived",
      "image": "news_images/982624244ed3e2bf6a9415ca8cd63cf6.png",
      "author": 1,
      "notified": false,
      "tags": [44, 45]
    }
  },
  {
    "model": "news.news",
    "pk": 8,
    "fields": {
      "title": "Уроки написания утилитки на $1 000 000",
      "brief": "Осенью 2008 года мы потратили две-три недели свободного от основной работы времени, чтобы написать маленькую утилитку для бэкапа баз данных (MS SQL Server и потом MySQL). Сегодня она приносит нам около $230 000 в год и можно с уверенностью говорить, что суммарно мы заработаем на ней больше $1 000 000. Под катом я расскажу, как это получилось и какие уроки мы из этого извлекли.",
      "content": "Начало\r\n\r\nА началось все с неудовлетворенной потребности. На основной своей работе мы делали разные проекты на .NET + SQL. И простая задача создания бэкапа базы данных, его компрессии и перекачки на FTP сервер часто требовала нагромождения скриптов и утилиток. Посмотрели на доступные решения — оные попадали в одну из трех категорий:\r\nДорогие и сложные (RedGate, LiteSpeed, Idera).\r\nВроде неплохие для бэкапа файлов, но SQL бэкап там в качестве невнятного довеска (Handy Backup, IBackup).\r\nДешевые или бесплатные недоделки в стиле VB6.\r\n\r\nРынку явно не хватало простого утилитарного продукта. Я поделился идеей с другом специализировавшимся на Windows-приложениях и предложил половину доходов. На мне был GUI и веб-сайт, на друге — собственно приложение.\r\n\r\nИнтерфейс\r\n\r\nСтратегию определили так: делать все просто, чтобы даже начинающий пользователь смог в минимум кликов получить результат. А именно: выбрать базы, заархивировать, послать в папку или на FTP, получить email с подтверждением и поставить в ежедневное расписание. Все эти действа мы и выложили на основную форму, спрятав все остальное за кнопками Advanced и Configuration.\r\n\r\nУрок 1 (он же главный): Найдите наикратчайший из способов удовлетворить потребность и не напрягайте пользователей деталями.\r\n\r\nНам через день предлагают добавить ту или иную фишку. Первый вопрос которым мы задаемся — а какому проценту наших пользователей это понадобиться. Если меньше 5% — мы этого делать не будем.\r\n\r\nУрок 2 (вообще-то продолжение первого): ненужная большинству функциональность вредна поскольку усложняет понимание.\r\n\r\nВот как мы расправились с некоторыми из сложностей:\r\n\r\nПрограмма должна была работать с несколькими проектами/работами. Однако для большинства достаточно создать только один проект выбрав несколько баз для бэкапа. Мы сделали так, что программа сама открывает тот же проект, что и в прошлый раз и соединяется с тем же SQL сервером — так что большинство даже и не задумывается, что можно работать с несколькими проектами.\r\nSQL Connection String — до сих пор самая сложная часть для пользователя. При первом запуске мы, не спрашивая пользователя, перебираем самые распространенные Connection String, так что, открыв программу, большинство пользователей уже подключились к серверу и видят список своих баз данных.\r\nПосылка писем — чтобы не напрягать пользователей с настройкой SMTP мы по умолчанию посылаем письма через веб-сервис на своем сервере. Для бесплатных пользователей фишка бесплатна на неделю, а потом можно либо купить платную версию либо пользоваться своим Gmail или другим SMTP сервером.\r\nРасписание — большинству требуется Full Backup один раз в день. Что и можно сделать на основной форме. Для более продвинутых все настройки спрятаны за кнопкой Settings.\r\n\r\nДеньги\r\n\r\nПоработав немного, мы сделали первую версию программки. Далее мы поставили ее во все shareware-сайты и оставили комментарии на форумах по этой теме. Понемногу пошли клиенты. Через два месяца после выпуска нас заметила одна большая компания, продукт которой был основан на SQL и его пользователи с небольшими техническими знаниями были сами ответственны за бэкап. Для них мы подходили идеально и они послали всех своих пользователей к нам. Кроме этого они даже взяли на себя заботу по тех поддержке. Деньги потекли рекой.\r\n\r\nОсновная версия (Standard) стоит сейчас $59. Для тех компаний для которых это не деньги — у нас есть Professional с добавкой AES encryption за $69. Для экономных — Lite (максимум 5 баз данных) за $29. С год назад я прочитал какую-то статью о том, что цены на странице Prices нужно подавать от больших к малым дабы пользователю, испуганному первыми большими цифрами, цифра в середине показалась относительно скромной. Мы подумали: что бы такого выпустить дорогого чтобы пугать пользователей? Так родилась идея Lifetime-версии за $199 (сейчас $149) с бесплатными пожизненными обновлениями. И мы очень удивились когда ее стали бодро покупать!\r\n\r\nПотом товарищ подкинул другую идею, которая принесла тысячи долларов. В добавок к продуктам мы продаем за небольшие деньги еще и Extended Support (тем, кто его купил — особое внимание при поддержке) и бесплатное обновление на 1 год (по умолчанию — 1 месяц). Дополнительные усилия близки к 0, а деньги понемногу капают…\r\n\r\nУрок 3 — дайте пользователю заплатить столько, сколько он хочет и может.\r\n\r\nПиратство и жадность\r\n\r\nС первых дней существования мы решили тратить только минимум времени на борьбу с пиратством. В программе зашит алгоритм на проверку лицензионного ключа который несложно взломать. Идея такова: если человек запускает keygen для взлома — он вряд ли заплатил бы за программу без этого. А так — будет пользоваться и, возможно, когда остепенится, тогда и почувствует потребность заплатить.\r\nМногие устанавливают ключик на несколько машин — мы просто посылаем вежливые письма с напоминанием, что это неправильно. Компании в цивилизованных странах стараются договоренности соблюдать и покупают недостающие лицензии. С менее цивилизованными мы могли бы справиться добавив активацию, но это усложнило бы жизнь для большинства честных клиентов. И опять же: нами пользуются и это уже хорошо.\r\n\r\nУрок 4 — концентрируйтесь на продукте, а не на защите. Пират сегодня — клиент завтра.\r\n\r\nБольшинству вполне хватает бесплатной версии в которой можно делать то же самое, что и в стандартной, только с ограничением в две базы данных. Благодарный народ даже пожертвования предлагает. Да мы и рады: когда потребности вырастут, тогда и заплатят, а заодно боремся с бесплатными самоделками.\r\nНедавно мы добавили бэкапы в Amazon S3, Google Drive и Dropbox. Сначала было желание брать дополнительные деньги. Но решили не напрягать пользователей и просто добавить к существующим версиям. Будет больше пользователей — значит и доходы вырастут.\r\n\r\nУрок 5 — довольные клиенты важнее сиюминутного наполнения карманов.\r\n\r\nДалее...\r\n\r\nВ следующей статье я расскажу о том, как работать с контракторами, как мы вбухали кучу денег куда не нужно, как мы раскручивались, как наш работник пытался создать конкурентный продукт, как мы поступаем с трудными клиентами, как получаем и делим деньги, как смотрим на финансирование, как бэкапим в Cloud, как ввели trial, что с локализацией и куда движемся дальше.",
      "pub_date": "2023-05-15T21:00:00Z",
      "views": 684,
      "status": "archived",
      "image": "news_images/10d5f73435832ac0e48135d5dcec1aee.jpg",
      "author": 1,
      "notified": false,
      "tags": [45, 46, 47]
    }
  },
  {
    "model": "news.news",
    "pk": 9,
    "fields": {
      "title": "Почему курсор мыши наклонён на 45°?",
      "brief": "Посетитель сайта вопросов-ответов StackExchange задал на первый взгляд глупый вопрос: а почему все курсоры во всех операционных системах немножко «кривые», то есть имеют определённый наклон, а не указывают прямо? В самом деле, почему курсор не располагается вертикально, ведь это наиболее удобно для выделения текста и прочих задач?",
      "content": "Ему отвечает эксперт, хорошо знакомый с историей компьютерной техники. Он подтверждает, что изобретатель мыши Дуглас Энгельбарт действительно изображал курсор в виде стрелки вверх, как наиболее логичный вариант выделения (см. скриншот вверху).\r\n\r\nОднако, графический интерфейс операционной системы на практике первой в мире реализовала компания Xerox, а именно — её научно-исследовательское подразделение Palo Alto Research Center. В частности, курсор описан в документе от 1981 года, который перечисляет характеристики XEROX PARC, первого в истории компьютера с графическим пользовательским интерфейсом.\r\n\r\nПри проектировании этой машины обнаружилось, что из-за низкого разрешения дисплеев того времени невозможно создать из пикселов нормальный вертикальный курсор маленького размера. Решено было не увеличивать размер указателя, а вместо этого слегка повернуть его, чтобы одна грань была вертикальной, а вторая наклонялась на 45°.\r\n\r\nМинуло более 30 лет, появились дисплеи высокого разрешения, но традиция изображать курсор наклонённым на 45° сохранилась.",
      "pub_date": "2023-05-03T15:00:00Z",
      "views": 540,
      "status": "archived",
      "image": "news_images/5c5bcc0e315d1afbff7c9045c3198431.png",
      "author": 1,
      "notified": false,
      "tags": [23, 25, 45]
    }
  },
  {
    "model": "news.news",
    "pk": 10,
    "fields": {
      "title": "Простой рельефный фон за 5 секунд",
      "brief": "Простой рельефный фон за 5 секунд и не более!",
      "content": "На сером фоне создаём новый слой с шумом, режим смешивания screen.\r\n\r\nКопируем этот слой, инвертируем (Ctrl+I), смещаем на 1 пиксель вниз, режим смешивания multiply.\r\n\r\nУменьшаем прозрачность обоих слоёв до 20%.\r\n\r\nТонируем (цветной слой в режиме soft light), можно дважды!\r\n\r\nОсвещаем по надобности (слои в режиме soft light), вставляем иконки, кнопки, текст или что там у вас в дизайне.\r\n\r\nИдея отсюда: designmoo.com/resources/simple-icons\r\nИконки отсюда: designmoo.com/resources/glyphs-psd\r\n\r\nДополнение: на втором шаге делаем edit→define pattern и дальше в работах используем pattern overlay в режиме luminosity.",
      "pub_date": "2023-03-27T09:00:00Z",
      "views": 600,
      "status": "archived",
      "image": "news_images/23dbdd3525932874a0e73d6a7d6fb6b6.jpg",
      "author": 1,
      "notified": false,
      "tags": [23, 44]
    }
  },
  {
    "model": "news.news",
    "pk": 11,
    "fields": {
      "title": "Почему папки желтые",
      "brief": "Папка — одна из самых известных метафор экранных интерфейсов.  Это очень мощный и сильный символ. За достаточно короткий период времени он сумел затмить термин, который был призван обозначать.  Понятие «директория» или «каталог» канули в Лету. Хотя «папка» когда была лишь метафорой для их обозначения в графических оболочках.\r\n\r\n",
      "content": "Directory (от лат. directorium — маршрут движения) в общем смысле обозначает некую структуру, содержащую набор определенной информации. Это может быть список людей или каталог адресов.\r\n\r\nСвоим появлением она обязана идее оснастить графический интерфейс легендарной рабочей станции Xerox Star (Xerox 8010) метафорами, понятными рядовому офисному клерку. Идеи черпались из стандартного канцелярского оснащения тогдашних офисов. Первым же коммерческим воплощением на массовом рынке стал интерфейс Apple Lisa.\r\n\r\nBasic folder appearanceA folder is drawn as a white rectangle (filled in by the application) with a thin (one pixel) black border. Every folder has a tab, which looks like a tab on a standard manilla folder. The tab is always above the upper left corner of the folder. It is called the title tab. The rectangular portion of the folder that holds the folder’s contents is called the body of the folder\r\n\r\n“Lisa user interface standards” (1980)\r\n \r\nБумажная папка\r\nПрототипом для метафоры послужила так называемая «манильская папка» (manila folder). Насколько я знаю в русском языке подобный термин отсутсвует (хотя иногда и мелькает в  художественной литературе, что, впрочем, может являться лишь ляпом). Правильно будет говорить просто «бумажная папка» или «папка».\r\nКонструктивно она представляет собой согнутый лист бумаги, внутрь которого можно вкладывать или подшивать документы.\r\n\r\nДанный тип папок не был известен на территории бывшего СССР, поэтому иконка папки отчасти являлась симулякром, т.е. не имела под собой предметной части, а только свойство. В системах Win 9x объект казался просто желтым прямогольничком с выступом, т.е. вещью абстрактной.\r\n\r\nАмериканский тип папок изготовляют из прочной бумаги, называемой «манильской». В ее состав входит «манильская пенька», волокна, добываемые из листьев текстильного банана или абаки (растение, родом с Филиппин). Волокна очень жесткие и обладают равномерной толщиной, легко окрашиваются. Хотя, как правило, манильскую бумагу не подвергают обработке красителями. Она сохраняет естественный цвет волокон: желтовато-бежевый. Вот почему иконки папок Windows и некоторых других систем — желтые или бежевые.\r\n\r\n Помимо бумаги манильскую пеньку, используют для производства морских канатов. По этой причине второе название манильской бумаги — «канатная».\r\n\r\nИз манильского волокна изготовляют чайные пакетики. Технологию разработал американский инженер Фэй Осборн. Во время второй мировой войны, в самый разгар исследований Осборна, манильская пенька стала стратегическим сырьем для флота. Инженеру пришлось придумать способ получения манильских волокон для чайных  пакетиков из… старых канатов.\r\n \r\nМатериал для изготовления папок достаточно гладкий, в составе бумаги нет грубых частиц, чтобы не поцарапать документы. Отсуствуют и химические активные компоненты, способные, вступить в реакцию с фотобумагой и повредить снимки, хранящиеся в папках. Существует стандарт, который требует, чтобы папки, попав в воду, не окрашивали содержимое в какой-либо посторонний",
      "pub_date": "2023-12-05T15:14:59Z",
      "views": 804,
      "status": "archived",
      "image": "news_images/85f8aa438bbf949528c145de2d220a9f.jpg",
      "author": 1,
      "notified": false,
      "tags": [4, 7, 23]
    }
  },
  {
    "model": "news.news",
    "pk": 12,
    "fields": {
      "title": "Как создать идеальную команду",
      "brief": "Кто лучше сеньор, мидл или джун?",
      "content": "Всем привет. Знакомые, коллеги, друзья, часто спрашивают меня, как построить команду. «Вот ты свои строишь так, что они спустя некоторое время горы сворачивают, хотя отдельные сотрудники не являются гениями. Как ты это делаешь?» Как‑то само получалось, решил написать о своем опыте в серии статей. Надеюсь зайдет. Это первая, про специализацию и кросс‑функциональность, про то, кто должен быть в команде.\r\n\r\nСпойлер: никак, идеальная команда — редкость, но можно сделать свою почти идеальной.\r\n\r\nЧто такое идеальная команда?\r\nЕсть разные мнения. Обычно все сводится к тому, что это универсальные специалисты, коллеги и друзья, которые работают бок о бок, не подведут в трудную минуту, умеют во все технологии, делают все быстро и безошибочно, которые мотивированы и занимаются интересной работой. Желательно, чтобы еще при этом не очень много по зарплате просили.\r\n\r\nДругими словами словами, классический образ из сказки о попе и о работнике его Балде. Только он не один, а их вся команда.\r\n\r\nПотом после некоторых дополнительных обсуждений и попыток нанять идеальных сотрудников, приходят к выводу, что, наверное, эти работники существуют, но, увы, крайне редко встречаются. И задаются вопросом, что же делать.\r\n\r\nОтвет очень простой. Посмотреть по сторонам, и понять, что ваша идеальная команда на самом деле рядом с вами, это ваша команда. Да, там могут быть поправки на культуру компании и особенности отдельных сотрудников. Но если нет критической ситуации, то ваша идеальная команда, на самом деле, рядом с вами и вы ее часть.\r\n\r\nПочему так получается?\r\nЕсть такая штука как Scrum Guide, в котором написано про кросс‑функциональные команды. Излишние цитаты ни к чему, много сказано на эту тему. В контексте данной статьи важно, что порой мы слишком увлекаемся индивидуальной кросс‑функциональностью в ущерб именно командной. Да, есть фуллстек разработчики. Да, в командах можно работать без наличия какой‑то специальности, типа аналитиков или тестировщиков. Сам одно время работал так, знаю, о чем говорю. Но ситуации, когда все делают всё, не видел нигде, кроме стартапов или небольших контор на этапе становления. Потом все равно специализация начинается.\r\n\r\nТуда же история с T‑Shape сотрудниками. Хорошо работает до определенного предела. Когда мы решаем простые и средние задачи, то в целом индивидуальная универсальность работает и команда реально перформит. Но как только встречается какая‑то узкоспециальная история, приходится звать на помощь сумрачного Васю, I‑Shape, который и общаться не всегда нормально общается, и знать про другие вопросы ничего не хочет. Сидит у себя в каморке и делает что‑то непонятное. А иногда нужен непонятный Иван Иванович, который явно ничем полезным не занимается, глубоко ничего не знает, но умеет переводить с русского на русский. Это человек‑прочерк, у него только верхняя палочка от буквы Т. При этом он действует как клей, соединяющий людей воедино.\r\n\r\nВидел, что хорошо работает подход с разумной специализацией как в римском легионе: где мы задаем набор правил, ролей, помогаем команде правильно организовать свою работу и тогда она сможет правильно делать правильные вещи, сама развиваться, сама достигать новых вершин. Когда Римская Империя задавала перцу всем своим соседям, она не была идеальной. И отдельные ее руководители не были идеальными (https://ru.wikipedia.org/wiki/Жизнь_двенадцати_цезарей). И отдельные римские легионеры не были идеальными. Средний римский воин был порой слабее карфагенянина или какого‑нибудь галла. А вот легион за счет правильной организации их на голову делал. Другими словами, разумная специализация.\r\n\r\nСпециализация бывает по уровню в профессии, по ролям, по технологиям.\r\n\r\nКто лучше сеньор, мидл или джун?\r\n\r\nСеньор. Круче него никого нет. Он сам тянет сложные темы и других за собой ведет. Только, если у вас команда из одних сеньоров, то у вас может не быть нужного количества сложных направлений. Они скучают, воюют друг с другом, пишут грустные истории про перекладывание json‑ов за кофе в крупной корпорации.\r\n\r\nМидл. Стоит не так дорого, почти сеньор и если правильно его раскочегарить, то сам может сделать реально много. Однако одни мидлы в команде тоже плохо. Некому будет вести ребят за собой, кроме вас. А если команда большая, то может потребоваться заместитель, хотя бы на время отпуска.\r\n\r\nДжуны. Много джунов при должной организации и наличии Stack Overflow богоподобны. Есть даже стратегия Zerg rush: «наймем много дешевых джунов, пару сеньоров и захватим мир». Стратегия интересная, только работает в ограниченном наборе случаев, когда у вас есть хороший бренд, стажеры, что называется, стоят за забором, проекты временные и не слишком сложные. Этой стратегией вы сжигаете своих сотрудников и свою команду.\r\n\r\nА если работаете вдолгую, то на самом деле нужны все, в разных пропорциях. Кто‑то делает и сложные задачи, а кто‑то простые. В зависимости от размера команды, это 1–2 сеньора на сложные вещи и архитектуру, 3–4 мидла на «тащить» и остальные джуны на простые задачи и на вырост.\r\n\r\nНо, допустим, есть члены команды, что они будут делать.\r\n\r\nКакие роли нужны?\r\nВ моей картине мира должны быть те, кто отвечают на следующие 4 вопроса:\r\n\r\nЧто мы хотим и с каким приоритетом?\r\n\r\nОбычно это заказчик или продуктолог (Product)\r\n\r\nКак мы можем это сделать и на каких технологиях?\r\n\r\nОбычно это техлид, техмен, архитектор (Tech)\r\n\r\nКак это организовать?\r\n\r\nОбычно это проджект (Project)\r\n\r\nКто это будет делать?\r\n\r\nРесурсный руководитель, ну или сами инженеры (Resource, Team, Function)\r\n\r\nНа какие вопросы еще отвечают?\r\n\r\nКто придумывает что‑то? То есть делает Дискавери (продуктовое или техническое исследование)\r\n\r\nЕго можно назвать Владельцем/Овнером (Owner)\r\n\r\nКто реализовывает что‑то? То есть делает Деливери (продуктовая или техническая реализация)\r\n\r\nЕго можно назвать Руководителем/Менеджером (Manager)\r\n\r\nЕсли скомбинировать, то получим вот такие варианты ролей. И бывает, что на эти вопросы отвечает один человек. А бывает несколько разных. И их можно объединять, например, вот так.\r\n\r\nТак все-таки, специализация или универсализация?\r\n\r\nМне нравится статья Мартина Фаулера по этому поводу.\r\nКратко. Речь идет про команды, ориентированные на результат, а не на деятельность. По сути, внутри команды действительно нет разделения по специальностям (аналитик, разработка, тестирование и т. п.), а все являются универсалами в истинном смысле этого слова. Там же про числа Данбара, принцип Безоса про две пиццы, закон Миллера и т. п.\r\n\r\nМы с вами живем в нашем несовершенном мире больших и не очень больших приложений, работающих на многих устройствах и платформах. Да, могут быть инженеры, которые и требования пишут, и тестируют, и проектируют, и, даже, код пишут. Кстати, получается быстро до определенного предела. Дальше у ребят появляется специализация, как минимум, разработчик‑тестировщик, а, обычно, еще и по платформам: фронты (desktop + touch), мобилки (Android + iOS), бекэнды на разных языках. Понятно, что за счет технологий и кросс‑платформенности это множество можно схлопнуть, но все‑таки не в 0. А еще где‑то бродят дизайнеры, аналитики и прочие важные специальности помимо разработки.\r\n\r\nА примеры будут?\r\nДисклеймер. Работает там, где я работал, у вас может быть другой набор профилей специалистов. Если, например, у вас standalone разработка, то профиль может быть совершенно иной.\r\n\r\nПример 1. Маленькая команда. Работает, когда нужно что‑то запустить на всех платформах сразу (фронты и мобилки).\r\n\r\nДостоинства:\r\n\r\nОтносительно быстро и легко собрать на короткой дистанции (до 3 месяцев). Быстро сделали, сдали дела и разбежались\r\n\r\nОбычно собирается, чтобы быстро затащить какую‑нибудь фичу и далее передать ее на баланс существующей команды\r\n\r\nЕсли нанимается сеньор‑универсал, то его производственная мощность может быть эквивалентна как раз этой команде\r\n\r\nНедостатки:\r\n\r\nBus‑factor, на каждой специальности по 1 человеку. Если кто‑то заболел или ушел в отпуск, работа может встать.\r\n\r\nВсе, что из этого следует\r\n\r\nПример 2. Средняя команда, которая может не только запускать, но и поддерживать неограниченно долгое время на всех платформах сразу (фронты и мобилки).\r\n\r\nДостоинства:\r\n\r\nМожно собрать на базе маленькой, и постепенно развивать\r\n\r\nМожет запускать и поддерживать одновременно\r\n\r\nВсе еще управляемая\r\n\r\nМожно шарить избытки ресурсов\r\n\r\nМожно играть в кроссплатформенность на уровне мобилок или фронтов\r\n\r\nНедостатки:\r\n\r\nУзкое горлышко на этапе дискавери, если кто‑то из дизайнеров или аналитиков будет отсутствовать, то могут быть небольшие проблемы\r\n\r\nПродуктолог может быть перегружен, поэтому ему требуется помощник для проработки краевых кейсов\r\n\r\nЛид может быть перегружен, если у него нет сеньоров в команде\r\n\r\nДальше можно поговорить про команды еще большего размера, но внутри них обычно появляются подкоманды со своей специализацией. Она может быть и неформальной, но она обязательно есть. Еще команду могут «накачивать» ресурсами, чтобы потом на ее базе отпочковать еще несколько, делают что‑то типа фабрики команд.\r\n\r\nЗаключение\r\nИ все‑таки, как собрать команду? И какую команду собирать? Для этого нужно ответить на следующие вопросы:\r\n\r\nКакие задачи должна решать команда?\r\n\r\nНа сколько они сложные и простые?\r\n\r\nКакие роли нужны для успешной реализации проекта? Кто будет отвечать на наши вопросы?\r\n\r\nУзкие или широкие специалисты?\r\n\r\nБольшая или маленькая команда?\r\n\r\nЯ отвечаю на эти вопросы так: вначале нужно посмотреть на фронт работ и планировать формирование команды исходя из него. Неважно, это короткий проект или работа на несколько лет, нужно понимать, что мы хотим делать. А уже из этого искать ребят. В моем опыте задачи обычно делятся на 10–20% сложных задач, 50–60% задач среднего уровня, 20–40% рутинных, может быть, даже неинтересных опытным специалистам, но которые тоже нужно делать. Роли могут быть разными и называться они могут как угодно, но должны отвечать на вопросы: что и как мы делаем, что нужно делать в первую очередь, а что может подождать. Как в технологиях, так и в продукте. Удобнее двигаться командами небольшого или среднего размера, где есть разумная специализация. Если у вас другой опыт, поделитесь в комментах.\r\n\r\nЕсть еще вопросы о том, как развивать команду, как мотивировать, делегировать и т. п. Об этом в следующий раз.",
      "pub_date": "2024-09-02T15:18:37Z",
      "views": 0,
      "status": "draft",
      "image": "news_images/09baf2e2344ed187f9027043b14e182b.jpg",
      "author": 1,
      "notified": true,
      "tags": [3, 7, 24, 38]
    }
  },
  {
    "model": "news.news",
    "pk": 13,
    "fields": {
      "title": "Инсайд: Lenovo выпустит «бюджетные» ПК Copilot Plus в сентябре",
      "brief": "Lenovo планирует выпустить более доступные ПК Copilot Plus, пишет Verge со ссылкой на утечку, опубликованную Эваном Блассом. Инсайдер представил пресс-релиз Lenovo, в котором подробно описан ряд ПК со встроенными функциями искусственного интеллекта.",
      "content": "Устройства из утечки анонсируют на выставке IFA, которая пройдёт с 6 по 10 сентября в Берлине.\r\n\r\nЛинейка новых ПК Copilot Plus на базе чипов Qualcomm включает ноутбук-трансформер Lenovo IdeaPad 5x 2-in-1 и ноутбук IdeaPad Slim 5x. Эти модели будут оснащены новыми 8-ядерными чипами Snapdragon X Plus.\r\n\r\nСтоимость IdeaPad Slim 5x составит €900, а IdeaPad 5x 2-in-1 — €1 тыс. Оба устройства можно будет приобрести в сентябре этого года. Розничная цена на Surface Laptop 7 от Microsoft составляет $1,2 тыс. — технически это самый дешёвый ПК Copilot Plus на текущий момент.\r\n\r\nТакже Lenovo планирует выпустить другие ПК Copilot Plus с процессорами Intel и AMD. Yoga Slim 7i Aura Edition — это 15-дюймовый ноутбук, работающий на новейших процессорах Intel Core Ultra Series 2. Yoga Pro 7 и IdeaPad Slim 5 базируются на последних процессорах AMD Ryzen.",
      "pub_date": "2024-09-02T15:21:14Z",
      "views": 0,
      "status": "draft",
      "image": "news_images/nyvcvdi4r-tc08y41t36glp1xsa.jpeg",
      "author": 1,
      "notified": true,
      "tags": [4, 31, 48]
    }
  },
  {
    "model": "news.news",
    "pk": 14,
    "fields": {
      "title": "Топ-5 ИБ-событий недели по версии Jet CSIRT",
      "brief": "Сегодня в ТОП-5 — новая фишинговая атака Unicode QR Code Phishing, уязвимость для удаленного выполнения кода в WPS Office, уязвимость в маршрутизаторах TP-Link, ложные срабатывания защиты в Exchange Online, устранение критичных уязвимостей в Chrome.",
      "content": "Новая фишинговая атака Unicode QR Code Phishing обходит современные средства защиты\r\n\r\nМетод Unicode QR Code Phishing, использующий текстовые символы Unicode вместо изображений, успешно обходит традиционные спам-фильтры и меры безопасности, ставя под угрозу пользователей и их данные. С начала 2024 года количество атак с использованием QR-кодов возросло на 587%. Несмотря на развитие технологий кибербезопасности, новые символьные QR-коды выглядят как обычные и могут легко считываться. Эксперты советуют пользователям избегать сканирования кодов из неизвестных источников и применять многоуровневые стратегии безопасности для защиты от таких угроз.\r\n\r\nГруппировка C-60 использует новую уязвимость для удаленного выполнения кода в WPS Office для Windows\r\n\r\nИсследователи ESET выявили уязвимость, связанную с выполнением кода в WPS Office для Windows CVE-2024-7262 (CVSS: 9,8), использовавшуюся группировкой C-60. Выполнение атаки происходит через вредоносный документ, замаскированный под XLS-файл, использующий скрытую гиперссылку для удаленного выполнения кода, позволяющего злоумышленникам внедрять вредоносное ПО SpyGlace. Рекомендуется обновить WPS Office до последней версии для устранения уязвимости и быть осторожными с файлами из неизвестных источников.\r\n\r\nВ маршрутизаторах TP-Link найдена уязвимость, позволяющая получить удаленный доступ к устройству\r\n\r\nВ маршрутизаторах TP-Link RE365 V1_180213 обнаружена критическая уязвимость CVE-2024-42815 (CVSS: 9,8). Угроза связана с переполнением буфера на HTTP-сервере маршрутизатора и позволяет получить удаленный доступ к устройству. Злоумышленники могут отправить специально созданный HTTP-запрос с длинным заголовком «User-Agent», что может привести к сбоям устройства или выполнению вредоносного кода. Это создает риск отказа в обслуживании и полной компрометации маршрутизатора. Пользователям рекомендуется обновить прошивку до версии RE365 V3 для защиты от потенциальных атак.\r\n\r\nMicrosoft: Exchange ошибочно помечает электронные письма как вредоносное ПО\r\n\r\nКомпания Microsoft устраняет проблему ложных срабатываний защиты в Exchange Online, из-за которой электронные письма с изображениями ошибочно помечались как вредоносные и отправлялись в карантин. Ошибка, зарегистрированная под номером EX873252, затрагивает широкий круг пользователей, включая сообщения с изображениями в подписи. Разработчики уже приняли меры по восстановлению 99% затронутых писем. Представители компании уточнили, что проблема связана с системами обнаружения вредоносного ПО.\r\n\r\nGoogle устранила четыре уязвимости высокого уровня опасности в Chrome\r\n\r\nGoogle устранила четыре уязвимости CVE-2024-7969(CVSS: 8,8), CVE-2024-8193(CVSS: 8,8), CVE-2024-8194(CVSS: 7,5), CVE-2024-8198(CVSS: 7,5) в Chrome, затрагивающие компоненты V8 и Skia. Все четыре уязвимости связаны с переполнением буфера HEAP с помощью заранее созданной злоумышленниками страницы HTML. Эксплуатация уязвимостей потенциально может вызвать ошибку типа «отказ в обслуживании» и позволить злоумышленнику выполнить произвольный код в целевой системе. Пользователям рекомендуется обновиться до последней версии Chrome 128.0.6613.113",
      "pub_date": "2024-08-31T15:22:32Z",
      "views": 406,
      "status": "published",
      "image": "news_images/e8f05796534f3aca10b10926613a83ca.jpg",
      "author": 1,
      "notified": false,
      "tags": [38, 49, 50]
    }
  },
  {
    "model": "news.news",
    "pk": 15,
    "fields": {
      "title": "Документальный фильм о фреймворке, который изменил мир AI",
      "brief": "Дэвид Касселл, автор статей для таких изданий, как CNN, MSNBC и Wall Street Journal Interactive Edition, рассказывает о PyTorch, фреймворке глубокого обучения, который используют более 60% AI-специалистов, через призму сюжета документального фильма “Powering the AI Revolution”. Мы выделили и перевели самые интересные моменты из его статьи.",
      "content": "PyTorch имеет захватывающую историю. Предлагаем ознакомиться с обстоятельствами его создания, стремительным взлетом и влиянием на мир искусственного интеллекта.\r\n\r\nВ самом начале своего существования технология AI была представлена множеством инструментов, которые боролись за внимание пользователей. \"Тогда было 15 или 20 инструментов, с помощью которых происходило ускорение развития\", вспоминает соучредитель PyTorch, Соумит Чинтала. Инновации происходили, но были изолированы и разрознены. В 2015 году появился TensorFlow от Google, отточенный и высокопрофильный продукт, построенный с помощью инженерных ресурсов Google.\r\n\r\nРождение PyTorch\r\nВ 2016 году исследовательская лаборатория искусственного интеллекта Facebook стремилась к \"прогрессу\" в области компьютерного зрения. Им нужны были AI-приложения для новостной ленты Facebook, поиска и рекомендаций. Соумит Чинтала, присоединившись к команде, взялся за создание фреймворка, способного выдержать нагрузку этих сложных задач. Так появился проект создания PyTorch. \r\n\r\nВзлет PyTorch к вершине\r\n\r\nДэвид Касселл рассматривает эффект от появления PyTorch через призму документального фильма “Powering the AI Revolution”. Его гибкость и простота в использовании, в сочетании с растущим сообществом исследователей AI, быстро привели к широкому распространению технологии. Документальный фильм продемонстрировал использование PyTorch в таких компаниях, как Disney, Pixar, Astra Zeneca и даже NASA.\r\n\r\nДоминирование PyTorch в мире искусственного интеллекта неоспоримо. Документальный фильм подчеркивает, как фреймворк стал ключевым компонентом передовых AI-приложений, таких как ChatGPT и Stable Diffusion. По мере того, как AI продолжает развиваться, PyTorch остается важным инструментом для исследователей и разработчиков, расширяющих границы возможного. Документальный фильм напоминает нам о невероятном прогрессе в области AI и о захватывающем будущем, которое нас ждет. \r\n\r\nПреимущества PyTorch\r\n\r\nPyTorch произвел революцию в разработке AI, предоставив исследователям и разработчикам надежный и гибкий фреймворк.\r\n\r\nПростота в использовании и гибкость фреймворка сделали его популярным выбором для широкого спектра AI-приложений.\r\n\r\nБудущее PyTorch выглядит светлым, его роль в передовых приложениях подчеркивает его постоянную актуальность и влияние.\r\n\r\nКлючевые моменты фильма\r\nВ документальном фильме “Powering the AI Revolution” рассказывается о том, как небольшой коллектив разработчиков из Meta создал фреймворк, который стал движущей силой для миллионов AI-проектов.\r\n\r\nВ фильме Соумит Чинтала рассказывает о том, как в команду разработчиков PyTorch попал студент-первокурсник из Варшавского университета Адам Пашке, искавший стажировку. Пашке был активным участником сообщества Lua Torch и делится своими воспоминаниями о 2016-м годе: \"Я был увлечен машинным обучением. Мне просто казалось, что это очень классная область, и я хотел больше узнать о ней\". \r\n\r\nВ период с декабря 2015 по апрель 2016 года небольшая команда работала над отделением математических функций C и C++ от связующих Lua. В итоге они осознали, что их можно связать с любым другим языком. \"Все остальные библиотеки уже были на Python, и люди были довольны этим языком\", вспоминает Пашке. Переход на Python был \"естественным следующим шагом\".\r\n\r\nPyTorch был выпущен в январе 2017 года, и Чинтала вспоминает, как несколько людей сказали ему: \"Вы помогли нам сделать великолепную работу\". Уильям Фалькон, генеральный директор Lightning AI, в то время использовавший TensorFlow для AI-исследований в Стэнфорде, отмечает: \"Это было как день и ночь\". Чинтала также отмечает: \"В 2017 году мы работали по 16 часов в день\".\r\n\r\nЗа два года работы над оптимизацией производительности PyTorch, его популярность взлетела. \r\n\r\n\"Мы стали наблюдать, как на основе PyTorch появляются новые библиотеки\", говорит Джо Спизак, который в то время возглавлял партнерство AI в AWS. Появились библиотеки для NLP, компьютерного зрения, обучения с подкреплением. \"Весь мир AI начал работать на его основе, как на стабильном фундаменте\".\r\n\r\nВ AMD заметили, что PyTorch стал предпочтительным фреймворком машинного обучения для \"множества различных клиентов, разных размеров, из разных отраслей\", вспоминает директор AMD по архитектуре решений Найлс Бербанк: \"Это было то, что будет иметь важное значение. Мы начали работать над тем, чтобы взять PyTorch и адаптировать его таким образом, чтобы он мог использовать преимущества аппаратного ускорения — в частности, наших GPU-продуктов\". В течение нескольких лет они тестировали улучшения на внутренней ветке и затем вносили их обратно в проект.\r\n\r\nЧинтала видел, что PyTorch используется крупными компаниями, занимающимися беспилотными автомобилями, включая Tesla, Uber и Cruise. \"Это было очень круто, даже немного пугало нас\", говорит он, \"мы чувствовали большую ответственность\" за то, чтобы код был без ошибок. В Microsoft разработчики тоже использовали PyTorch, в том числе в таких ведущих проектах Microsoft, как UnlimBot и Office.\r\n\r\nСпизак вспоминает, как в итоге Google тоже задумалась о поддержке PyTorch на своих TPU. Дварака Раджагопал, который руководил командой PyTorch Core Frameworks в Meta, а теперь является старшим директором по разработке Google AI, считает, что это было своего рода вехой. Раджагопал описывает это как доказательство того, что PyTorch можно перенести на другие аппаратные платформы, помимо GPU, и называет это \"довольно важным моментом\".\r\n\r\nВ фильме также рассказывается о решении 2022 года перенести проект с открытым исходным кодом PyTorch в собственный фонд. В то время Linux Foundation пошутил: \"Мы благодарны Meta за то, что они \"передали нам фреймворк.\".\r\n\r\nВ 2022 году PyTorch был передан в фонд Linux Foundation. Это подчеркивает важность открытого кода в развитии AI: \"Сообщества с открытым исходным кодом играют и будут играть ведущую роль в разработке инструментов и решений, которые делают AI и ML возможными — и делают их лучше с течением времени\", — говорится в заявлении фонда. За год (с августа 2021 по август 2022) в проект PyTorch было внесено более 65 000 коммитов, а участие приняли более 2 400 разработчиков.\r\n\r\nВ завершении документального фильма разработчики делятся своим видением будущего PyTorch. \"Каждый день мы оглядываемся вокруг и говорим: \"Да, это мы там. Это мы там\". Это так круто видеть\", — говорит Джо Спизак. А Дварака Раджагопал добавляет: \"Я считаю, что мы только начинаем\".\r\n\r\nБрайан Грейнджер из AWS утверждает, что на основе фундаментальных проектов с открытым исходным кодом, таких как PyTorch, возникают новые уровни инноваций, позволяющие людям и организациям \"делать то, что они никогда не смогли бы сделать без этих уровней инноваций, построенных на вершине этих проектов с открытым исходным кодом\". Спизак прогнозирует, что PyTorch будет в центре еще более разнообразного набора платформ: \"Будь то вычисления на устройствах, окружающие вычисления или носимые устройства.\".\r\n\r\nПаринита Рахи из Microsoft предсказывает, что все больше и больше приложений будут построены с использованием мощных языковых моделей (LLM), освобождая людей от ограничений аппаратных средств для создания решений, обогащающих жизнь. \"Все в наших руках\", — считает она. Найлс Бербанк из AMD также прогнозирует яркое будущее, возникшее благодаря более совершенным технологиям. \"Когда вы применяете больший объем вычислений или большее количество итераций к задаче, те же основные методы продолжают давать все лучшие и лучшие результаты\".\r\n\r\nВ итоге он видит мир, где исследователи и промышленные клиенты берут LLM и \"масштабируют их так, что даже по стандартам вычислительной отрасли это беспрецедентно\".\r\n\r\nМы в Шерпа Роботикс стремимся сделать наш центр искусственного интеллекта Sherpa AI Server таким же полезным и значимым для корпоративной ИИ-экосистемы использования генеративных языковых моделей, каким PyTorch стал для открытого сообщества в сфере традиционных нейросетей и глубокого обучения.\r\n\r\nБудучи коробочным продуктом для быстрой ИИ-трансформации компаний, Sherpa AI Server “под капотом”, разумеется, использует и PyTorch, и многие другие проверенные временем открытые библиотеки.\r\n\r\nВсячески желаем PyTorch дальнейшего развития.\r\n\r\nА Вы уже посмотрели фильм “Powering the AI Revolution”? Поделитесь впечатлениями в комментариях.",
      "pub_date": "2023-08-07T15:24:04Z",
      "views": 6,
      "status": "archived",
      "image": "news_images/44af4e9e4bbd8befddc6ad27cabb7c48.png",
      "author": 1,
      "notified": false,
      "tags": [51, 52]
    }
  },
  {
    "model": "news.news",
    "pk": 16,
    "fields": {
      "title": "Компания LoveFrom Джонни Айва представила лёгкие многослойные костюмы с минимумом швов и пуговиц",
      "brief": "Компания LoveFrom Джонни Айва совместно с брендом Moncler представила лёгкий многослойный костюм в виде куртки-трансформера с минимальным количеством швов и пуговиц. Внешние элементы одежды крепятся к основе при помощи аналога MagSafe.",
      "content": "Первая модель проекта — тёплый жилет, к которому с помощью магнита можно прицепить пончо, куртку или парку. По ощущениям такая одежда напоминает тёплое кимоно. Элементы одежды каждого из трёх дополнительных слоёв сшиты таким образом, чтобы их форма оказалась без швов.\r\n\r\nВ LoveFrom планируют выпустить первые модели одежды в продажу с 24 сентября. Цена и наличие дополнительных слоёв в комплекте пока не озвучены.\r\n\r\nДжонни Айв работал дизайнером в Apple с 1992 года по 2019 год. В 2015 году он стал директором компании Apple по дизайну. Айв создал множество культовых продуктов, в том числе iMac, алюминиевый и титановый PowerBook G4, MacBook, MacBook Pro (Unibody), iPod, iPhone и iPad. Кроме промышленного дизайна, Джони Айв внёс значительный вклад в проектирование программного обеспечения Apple. В 2013 году он представил значительно обновлённый дизайн операционной системы iOS 7, а потом представил революционные изменения в облик десктопной операционной системы macOS.\r\n\r\nПосле ухода из Apple Айв открыл креативную студию LoveFrom. Её клиентами являются Apple, Airbnb, Ferrari и другие компании.\r\n\r\nВ июле 2023 года Джони Айв впервые после ухода из Apple занялся аппаратным дизайном. Компания LoveFrom приняла участие в создании юбилейной версии винилового проигрывателя Linn Sondek LP12. Таким образом британский аудиобренд Linn решил отметить 50-летие устройства.",
      "pub_date": "2024-09-07T13:42:10Z",
      "views": 4,
      "status": "published",
      "image": "news_images/lj4dgyharbbxvb7hyfbpwl5r3ze.jpeg",
      "author": 1,
      "notified": false,
      "tags": [23, 38, 59]
    }
  },
  {
    "model": "news.news",
    "pk": 17,
    "fields": {
      "title": "Релиз композитного сервера Weston 14.0",
      "brief": "В начале сентября 2024 года состоялся релиз композитного сервера Weston 14.0. В рамках этого открытого проекта развиваются технологии, содействующие появлению полноценной поддержки протокола Wayland в Enlightenment, GNOME, KDE и других пользовательских окружениях.",
      "content": "В начале сентября 2024 года состоялся релиз композитного сервера Weston 14.0. В рамках этого открытого проекта развиваются технологии, содействующие появлению полноценной поддержки протокола Wayland в Enlightenment, GNOME, KDE и других пользовательских окружениях.\r\n\r\nПо данным OpenNET, разработка Weston нацелена на предоставление высококачественной кодовой базы и рабочих примеров для использования Wayland в десктоп-окружениях и встраиваемых решениях, таких как платформы для автомобильных информационно-развлекательных систем, смартфонов, телевизоров и прочих потребительских устройств. Код проекта распространяется на GitLab под лицензией MIT.\r\n\r\nОсновные изменения и дополнения в Weston 14.0:\r\n\r\n• в бэкенд вывода через DRM (Direct Rendering Manager) добавлена поддержка аппаратного наложения графичеcких элементов (hardware underlay). Включён режим атомарного асинхронного переключения между двумя буферами в видеопамяти (atomic async flip);\r\n\r\n• в файл конфигурации добавлена настройка 'mirror-of' для организации зеркалирования вывода;\r\n\r\n• в бэкенд вывода через мультимедийный cервер Pipewire добавлена поддержка технологии DmaBuf;\r\n\r\n• в клиенте simple-egl разрешено использования просвечивающих поверхностей с 16-разрядным представлением цвета. Добавлена опция для использования EGL-расширения EGL_EXT_present_opaque. Реализована поддержка сжатия поверхностей;\r\n\r\n• в бэкенде для вывода через протокол RDP добавлена поддержка FreeRDP 3.x;\r\n\r\n• в бэкенде вывода через VNC предоставлена возможность отключения TLS и использования пароля для аутентификации в режиме без TLS;\r\n\r\n• в libweston добавлена поддержка расширения протокола Wayland для управление цветом (color-management). Реализована возможность ограничения области перемещения указателя на полноэкранных поверхностях;\r\n\r\n• в компонент для отрисовки через OpenGL (gl-renderer) добавлена поддержка захвата вывода OpenGL ES 3 и OpenGL ES 2 в асинхронном режиме, а также возможность изменения цвета объектов при помощи шейдера.",
      "pub_date": "2024-09-07T13:44:35Z",
      "views": 51,
      "status": "published",
      "image": "news_images/b62c84055553ae1900811bf3d033bc3f.jpg",
      "author": 1,
      "notified": false,
      "tags": [38, 65]
    }
  },
  {
    "model": "news.news",
    "pk": 18,
    "fields": {
      "title": "«Кинопоиск» запустил «Изилогин» — быструю авторизацию на умных телевизорах по Wi-Fi",
      "brief": "Видеосервис «Яндекса» «Кинопоиск» запустил «Изилогин» — быструю авторизацию на умных телевизорах по Wi-Fi для доступа к развлекательному контенту, онлайн-телеканалам и трансляциям спортивных событий без необходимости ввода пароля и логина.",
      "content": "Разработчики сервиса пояснили Хабру, что новая опция позволяет быстро входить в свой аккаунт без ввода пароля или кода с помощью пульта — достаточно несколько раз коснуться экрана смартфона. Мгновенная авторизация работает через Wi-Fi, поэтому оба устройства должны быть подключены к одной сети.\r\n\r\nЧтобы воспользоваться «Изилогин», нужно перейти в свой профиль на смартфоне в мобильном приложении сервиса и нажать «Подключить \"Кинопоиск\" на вашем телевизоре». После этого приложение само найдёт ТВ-устройство, а затем попросит ввести двузначный код с мобильного экрана.\r\n\r\nВ «Яндекса» добавили, что опция «Изилогин» доступна на всех устройствах Smart TV, работающих на операционной системе Android, и на любых телевизорах LG.\r\n\r\n«Мы решили максимально ускорить, облегчить этот процесс [логина на телевизоре] и сократить его до нескольких касаний экрана смартфона. Самое классное — когда приезжаешь в отель, подключаешься к Wi-Fi и мгновенно включаешь свой „Кинопоиск“ на телевизоре в номере»\r\n— рассказал руководитель «Кинопоиска» Александр Дунаевский.\r\n\r\nРанее СМИ сообщили. что с 2024 года по 2025 год «Яндекс» вложит в фильмы, сериалы, музыку и книги более 100 млрд рублей. В 2024 году доля инвестиций компании в российский контент уже превысила инвестиции в иностранный в три раза, рассказали Хабру в пресс‑службе «Яндекса».\r\n\r\nВ конце августа 2024 года «Яндекс» поменял стоимость базовой подписки «Яндекс Плюс», добавив туда новые опции: «Букмейт» (свыше 250 тысяч электронных книг, аудиокниг и комиксов) и «Больше кино» (более 400 фильмов и сериалов, 27 неэфирных телеканалов). Пользователи, у кого подписка «Букмейт» или «Больше кино» была ранее, будут платить меньше. Если подключён «Плюс с Амедиатекой», то состав подписки расширится, но стоимость и название не изменятся. До 1 октября подписка с новым контентом будет стоить для них как раньше — 299 рублей в месяц, а после этой даты — 399 рублей в месяц.",
      "pub_date": "2023-09-05T09:00:00Z",
      "views": 26,
      "status": "archived",
      "image": "news_images/e87a79225e3e8c9d4b8bf04c96f103b6.jpg",
      "author": 1,
      "notified": false,
      "tags": [3, 4, 13, 60]
    }
  },
  {
    "model": "news.news",
    "pk": 19,
    "fields": {
      "title": "Пользователей TikTok признали мошенниками после «глюка бесплатных денег» Chase Bank",
      "brief": "Пользователи, которые применили вирусный «глюк бесплатных денег» из TikTok в банкоматах Chase Bank, официально признаны мошенниками.",
      "content": "На прошлых выходных в TikTok завирусились видеоролики, в которых якобы показывалось, как получить бесплатные деньги в банкоматах американского Chase Bank по всей стране. Техника заключалась в том, чтобы внести чек на большую сумму денег, которой у пользователя на самом деле не было, и снять меньшую до официального зачисления. Этот «сбой» признали мошенничеством. Теперь JP Morgan Chase сообщает властям о тех, кто провернул подобный трюк.\r\n\r\n«Как и в случае с любым вопросом, связанным с мошенничеством, мы проводим внутреннюю проверку и при необходимости обращаемся в правоохранительные органы. Независимо от того, что вы видите в Интернете, внесение поддельного чека и снятие средств со своего счёта — это мошенничество, простое и понятное», — заявил представитель Chase. \r\n\r\nНе совсем ясно, сколько людей успели попробовать эту схему, но в WSJ сообщают, что их «тысячи». Вирусные ролики стали настолько популярными, что набрали десятки миллионов просмотров.\r\n\r\nВ одном видео женщина по телефону пытается объяснить своей матери, что та может заработать от $40 000 до $50 000 долларов с помощью денежного «глюка». Мать настроена скептически и говорит, что не хочет закрытия своего банковского счёта, но дочь настаивает, что этого не произойдёт. В некоторых видеороликах в TikTok люди разбрасываются снятыми деньгами, празднуя их лёгкий заработок.\r\n\r\nБанк заявил, что уже заморозил некоторые счета клиентов и передаёт полиции «записи видеонаблюдения и другую информацию, связанную с отдельными лицами».\r\n\r\nВ новых видео авторы высмеивают пользователей, которые думали, что это просто глюк, а не мошенничество с чеками. «Только TikTok мог превратить крупное воровство в “лайфхак” и переименовать мошенничество с чеками в “сбой”», — говорит один из них.\r\n\r\nСлужба почтовой инспекции США также прокомментировала инцидент: «Не верьте тренду TikTok, мошенничество с чеками — это серьёзное преступление. Вас будут преследовать по закону».",
      "pub_date": "2024-09-02T03:00:00Z",
      "views": 26,
      "status": "published",
      "image": "news_images/7f658abc128f6a09f565f07ef91e8145.jpg",
      "author": 1,
      "notified": false,
      "tags": [66, 67]
    }
  },
  {
    "model": "news.news",
    "pk": 20,
    "fields": {
      "title": "Умелец превратил телевизор LG OLED в iPhone весом почти в 200 кг",
      "brief": "Автор YouTube-канала DIY Perks Мэттью Перкс показал, как он превратил телевизор LG OLED диагональю 223 см в рабочую копию iPhone 15 Pro Max весом почти в 200 кг. Он потратил на работу год и более $70 тысяч.",
      "content": "Перкс начал свою сборку с экрана — ему требовалось превратить 88-дюймовый OLED-телевизор LG Signature в отзывчивый сенсорный экран. Он поручил производителю изготовить кусок сенсорной пленки размером с экран, который закрепил с помощью прозрачного клея на основе УФ-эпоксидной смолы.\r\n\r\nСледующей задачей было найти способ разместить в рамке увеличенные версии компонентов смартфона: динамики, массив из трёх объективов камеры, кнопки регулировки громкости и питания, а также кнопку специальных функций. Перкс сконструировал рамку из алюминия с крестообразной опорой посередине. В качестве камер он решил использовать Canon EOS R5 и Sony RX10 Mark 4. Рамка крепится к аналогичной увеличенной подставке для смартфона. Смартфон оснащён восемью динамиками мощностью 50 Вт, оперативной памятью в 128 Гб, а роль аккумулятора играют портативные батареи Anker.\r\n\r\nДля имитации iOS использовалась ОС Bliss. Блогер даже смог установить на устройство Flappy Bird.\r\n\r\nПеркс протестировал смартфон. Он смог совершать покупки, отправлять электронные письма и совершать видеозвонки. \r\n\r\nРанее Мэттью превратил консоль PlayStation 5 в подобие планшета, а также смог создать подобие кулера для Canon R5, который позволяет камере работать без ограничений за счёт охлаждения водой.",
      "pub_date": "2024-09-04T09:00:00Z",
      "views": 102,
      "status": "published",
      "image": "news_images/a18e28019dd011b321743d21359ca0b3.jpeg",
      "author": 1,
      "notified": false,
      "tags": [4, 23, 68]
    }
  },
  {
    "model": "news.news",
    "pk": 21,
    "fields": {
      "title": "Исследование: ПК с Windows 11 может показывать разную производительность без явной причины 2 мин 2.6K",
      "brief": "Авторы YouTube канала Hardware Unboxed опубликовали результаты тестирования процессоров AMD Ryzen 7 9700X и 7700X в Windows 11 23H2 и 24H2 сборки 26100, которое показало серьёзный прирост производительности в новой версии ОС за счёт наличия оптимизаций кода прогнозирования ветвлений. Однако другие тестировщики заметили лишь небольшой прирост, что заставило усомниться в результатах, полученных HwU. Вероятно, дело не в тестах, а собственно в системе.",
      "content": "В YouTube Hardware Unboxed отмечают, что средний прирост производительности за счёт перехода на Windows 11 24H2 для AMD Ryzen 7 7700X составил 10% по результатам тестирования 43 игр, для 9700X — 11%. Процессор из новой серии не смог существенно усилить свою позицию относительно предшественника. Минимум в 17 играх прирост производительности за счёт перехода на Windows 11 24H2 превысил 10%, в 6 из них результаты улучшились на 20% и более. В Gears 5 прирост производительности и вовсе превысил 30%: в новой ОС средняя частота кадров в игре выросла на 33% в случае с системой на базе AMD Ryzen 7 7700X; на 35% в случае с системой на базе 9700X. \r\n\r\nПричина не только в оптимизациях AMD, но и в обновлении операционной системы в целом, так как на системе с процессором Intel Core i5-14600K игра тоже стала работать значительно лучше при переходе на Windows 11 24H2. Но в других играх на Intel Core i5-14600K результаты в Windows 11 24H2 остались такими же, как и в 23H2. \r\n\r\nХотя результаты тестов кажутся точными, также возможно, что пользователи не увидят такого большого прироста на своей собственной системе после обновления с 23H2 до 24H2. Похоже, что в самой ОС есть определённая проблема, которая может нанести ущерб производительности ПК даже после чистой установки, и выявить причину практически невозможно.\r\n\r\nВ своих диаграммах HwU обозначили установку Windows 11 23H2, которая показала лучшую производительность, как «хорошую», а ту, которая имела худшие показатели, как «плохую». «Исправление» относится к бэкпортированным оптимизациям прогнозирования ветвлений, которые Microsoft выпустила для 23H2. Разница в производительности составляет 9% в пользу 24H2 по сравнению с ПК с «хорошей установкой» Windows 11 23H2, и это несмотря на то, что использовались только 23 тщательно отобранные игры. Предыдущий тест с «плохой установкой» 23H2 показал улучшение на 11% в 43 играх. Это ясно указывает на то, что «плохая установка» Windows 11 может серьёзно навредить производительности.\r\n\r\nРанее сообщалось, что Microsoft начала выпускать обновление Windows 11 2024 версии 24H2 для ПК без Copilot+ для устройств, чьи производители предустановили данную версию.",
      "pub_date": "2024-09-03T14:04:22Z",
      "views": 50,
      "status": "published",
      "image": "news_images/fafcecb8a83925fcb92dec53b134c1c4.jpg",
      "author": 1,
      "notified": false,
      "tags": [21, 42, 69]
    }
  },
  {
    "model": "news.news",
    "pk": 22,
    "fields": {
      "title": "Корабль Starliner успешно отстыковался от МКС в автоматическом режиме и возвратился без экипажа на Землю",
      "brief": "7 сентября 2024 года корабль Starliner успешно отстыковался от МКС в автоматическом режиме и возвратился без своего экипажа на Землю. Астронавты этой тестовой миссии Бутч Уилмор и Суни Уильямс вернутся с МКС на Землю на корабле SpaceX Crew Dragon в феврале 2025 года.",
      "content": "6 июня 2024 года первый пилотируемый корабль Starliner пристыковался к МКС на двухнедельную проверку работы космического изделия от корпорации Boeing. Без проблем не обошлось. Во время полёта была зафиксирована утечка гелия, необходимого для работы двигателей ориентации. Более того, 5 из 28 таких двигателей на корабле отказали, только 4 удалось вернуть в строй.\r\n\r\n24 августа 2024 года в НАСА заявили, что вернут застрявших астронавтов экипажа Starliner корпорации Boeing Бутча Уилмора и Суни Уильямс с МКС на Землю на корабле SpaceX Crew Dragon в феврале 2025 года. Корабль Starliner решено не использовать для их возвращения из-за возможных проблем и необходимости поддержать высокий уровень безопасности полётов при отстыковке и доставке обратно экипажей со станции. НАСА исключило двух астронавтов из миссии SpaceX Crew-9, чтобы освободить место для экипажа Boeing Starliner.\r\n\r\nВ конце августа НАСА объявило дату возвращения Starliner.\r\n\r\nЧерез шесть часов после отстыковки от МКС Starliner приземлился на космическом полигоне в штате Нью-Мексико. «Starliner отстыковался от станции и теперь возвращается на Землю», — уточнили в НАСА. После отстыковки корабль дважды кратковременно включил двигатели ориентации и начал манёвры схода с орбиты.\r\n\r\nПриземление состоялось в 00:01 по времени восточного побережья США (07:01 мск). После вхождения в атмосферу аппарат выпустил три парашюта и приземлился на территории полигона Уайт-Сэндс в штате Нью-Мексико. «Starliner вернулся на Землю», — подтвердили в НАСА.\r\n\r\n31 августа 2024 года космический корабль Starliner компании Boeing, который был пристыкован к МКС, начал издавать повторяющийся «пульсирующий» звук. Астронавт экипажа Starliner Бутч Уилмор обратился в НАСА за помощью в выяснении причины возникновения звуков, похожих на звуки сонара, исходящих от спикера внутри Starliner.\r\n\r\n2 сентября 2024 года в НАСА сообщили, что инженеры выяснили причину повторяющегося «пульсирующего» звука из динамика Starliner на МКС, который прекратился через некоторое время. Странный звук, который издавал застрявший на МКС корабль Boeing Starliner, стал результатом акустической обратной связи от динамика внутри корабля.\r\n\r\nКорабль без астронавтов покинул Международную космическую станцию ​​(МКС) в пятницу, 6 сентября, в 18:04 по времени восточного побережья США (01:04 мск 7 сентября).",
      "pub_date": "2024-09-05T14:08:06Z",
      "views": 39,
      "status": "published",
      "image": "news_images/a6sub99qi0fjy_wwiw-bsfx6evc.png",
      "author": 1,
      "notified": false,
      "tags": [70, 71]
    }
  },
  {
    "model": "news.news",
    "pk": 23,
    "fields": {
      "title": "Российские школьники получили четыре золотые медали на Международной олимпиаде по информатике IOI 2024",
      "brief": "6 сентября 2024 года российские школьники получили четыре золотые медали на 36-й Международной олимпиаде по информатике IOI 2024. Мероприятие IOI 2024 (International Olympiad in Informatics) проводится в Египте с 1 по 8 сентября. В IOI 2024 зарегистрировались 351 участник. Сборная РФ выступала под нейтральным статусом, её участники заняли 10, 11, 20 и 27 места в общем зачёте (до 30 места включительно присваивались золотые медали). По сумме баллов лидирует команда из США. Первые места в общем зачете получили участники из Китая, Польши и США.",
      "content": "Олимпиада IOI-2024 состояла из двух туров, на каждый из которых отводилось по пять часов. За это время участники должны были решить в совокупности шесть алгоритмических задач.\r\n\r\nСостав сборной РФ по информатике 2024 года:\r\n\r\n• Дарья Грекова, школа № 57 в Москве, абсолютная победительница ВсОШ по информатике 2024 года, ученица курса «Яндекса» по олимпиадному программированию;\r\n\r\n• Иван Пискарев, школа № 2086 в Москве, золотой медалист IOI-2023, выпускник курса «Яндекса» по олимпиадному программированию.\r\n\r\n• Петр Лосев, школа № 57 в Москве, один из победителей заключительного этапа ВсоШ по информатике 2024 года, ученик курса «Яндекса» по олимпиадному программированию;\r\n\r\n• Гимран Абдуллин, лицей-интернат №2 в Казани, золотой медалист IOI-2023.\r\n\r\nВ качестве руководителей и тренеров команду вели и сопровождали:\r\n\r\n• Андрей Станкевич, доцент факультета информационных технологий и программирования Национального исследовательского университета ИТМО;\r\n\r\n• Алексей Малеев, директор Высшей школы программной инженерии и руководитель Центра развития IT-образования Московского физико-технического института (Национальный исследовательский университет);\r\n\r\n• Иван Сафронов, магистр ФКН НИУ ВШЭ, золотой медалист ICPC (Международной студенческой олимпиады по программированию);\r\n\r\n• Филипп Грибов, магистр ФКН НИУ ВШЭ, бронзовый медалист ICPC.\r\n\r\n«Яндекс с 2008 года поддерживает соревнования по программированию и готовит талантливых ребят к ним. В этом году учащиеся курса по олимпиадному программированию стали золотыми медалистами международной олимпиады IOI. Этот результат подтверждает высокое качество подготовки на образовательных программах Яндекса и служит для нас поводом для гордости. Поздравляем ребят с успехом», — сообщил директор «Яндекс Образования» Дарья Козлова.\r\n\r\nОлимпиадное программирование от «Яндекса» — это курс для школьников 6–11-х классов, который помогает готовиться к олимпиадам по программированию. Под руководством преподавателей-олимпиадников ученики знакомятся с алгоритмами разного уровня сложности и учатся решать задачи с их применением. Обучение бесплатное, набор на это направление проходит на конкурсной основе по всей России.\r\n\r\nМеждународная олимпиада по информатике проводится с 1989 года. В 2022 году на IOI 2022 в Индонезии сборная России завоевала три золотые и 1 серебряную медаль. На 35-й Международной олимпиаде по информатике в Венгрии в 2023 году российские школьники получили четыре золотые медали.",
      "pub_date": "2024-09-04T21:00:00Z",
      "views": 14,
      "status": "published",
      "image": "news_images/8c98607fe6d2c410fbb6debc685c7d37.png",
      "author": 1,
      "notified": false,
      "tags": [2, 38]
    }
  },
  {
    "model": "news.news",
    "pk": 24,
    "fields": {
      "title": "TCL представила 50 PRO NXTPAPER 5G с режимом просмотра в стиле Kindle и ограничением времени пребывания в соцсетях",
      "brief": "Если 10-15 лет назад компании стремились избавиться от примитива и перевести пользователей на высокие технологии, то в последние годы как-то популярно стало возвращать их на землю и проявлять заботу. Вот Nokia HMD выпустил линейку так называемых «немых телефонов» («dumbphones»), чтобы сократить количество часов, проводимых людьми в социальных сетях. Компания TCL решила двигаться в том же трендовом направлении и сделала кнопку превращения смартфона в чёрно-белую книгу, создав две новых модели – 50 Nxtpaper 5G и 50 Pro Nxtpaper 5G.",
      "content": "Новинки отличаются друг от друга немногим, судя по описанию на официальном сайте TCL:\r\n\r\n➥ 50 Nxtpaper 5G ➤ ROM 256GB, доступно 231GB, хранилище на 256GB, фронтальная камера 8MP (FF, sensor size 1/4”, pixel size 1.12μm, aperture F2.0, field of view 77.8°, 4P lens), различия в сетях и слотах для сим-карт и в комплектации (здесь только кабель USB Type-C 2.0 и документы). Цена и регион продажи - ЕС, €229.\r\n\r\n➥ 50 Nxtpaper Pro ➤ ROM 512GB, доступно 486GB, хранилище на 512GB, фронтальная камера 32MP (FF, sensor size 1/3.45”, pixel size 0.64μm, aperture F2.0, field of view 71.5°, 5P lens), различия в сетях и слотах для сим-карт и в комплектации (здесь дополнительно в зависимости от региона продаж: зарядное устройство (33 33W), чехол и/или гарнитура). Цена и регион продажи - ЕС и Латинская Америка, €299.\r\n\r\nУ обеих моделей аккумулятор 5010mAh, дисплей 6,8 дюймов (1080 x 2640) с частотой обновления 120Hz и новый переключатель «Nxtpaper Key». Он позволяет пользователям выбирать между стандартным цветным режимом и Max Ink, описываемым TCL как «e- ink format»Upd, который «ограничивает социальные приложения и уведомления». Всё ради того, чтобы предотвратить бесцельный скроллинг лент соцсетей и перетянуть пользователей на сторону полезного использования, например, чтения.\r\n\r\nМодели выйдут в сером, синем, белом, розовом и золотом цветах. Даты выпуска пока не объявлены.",
      "pub_date": "2024-09-03T15:00:00Z",
      "views": 48,
      "status": "published",
      "image": "news_images/d84c5a7410d9fd06bb350e25cac7ccc1.jpg",
      "author": 1,
      "notified": false,
      "tags": [4]
    }
  },
  {
    "model": "news.news",
    "pk": 25,
    "fields": {
      "title": "Братья Уайанс, создатели оригинального \"Очень страшное кино\", воссоединились спустя 18 лет для работы над 6 частью",
      "brief": "Издание Deadline сообщает о том, что создатели \"Очень страшное кино\" и \"Очень страшное кино 2\", братья Уайанс, воссоединились спустя 18 лет для работы над предстоящим фильмом \"Очень страшное кино 6\".",
      "content": "Сообщается, что Марлон Уайанс, Шон Уайанс и Кинен Айвори Уайанс напишут сценарий для шестой части, а так же выступят продюсерами фильма. О чем именно будет сюжет фильма - на данный момент неизвестно.\r\n\r\nСъемки фильма начнутся в следующем году. Первоначально Paramount планировала выпустить фильм в 2025 году, но скорее всего его премьеру перенесут на 2026 год.",
      "pub_date": "2024-10-30T15:23:08Z",
      "views": 10,
      "status": "published",
      "image": "news_images/KyLx25qALAR0r3vcYDO9dQ.png.webp",
      "author": 1,
      "notified": true,
      "tags": [13]
    }
  },
  {
    "model": "news.news",
    "pk": 26,
    "fields": {
      "title": "А что случилось? Sony закрывает Firewalk Studios, которая занималась разработкой шутера Concord",
      "brief": "Sony закрывает Firewalk Studios, студию, создавшую игру Concord, которая была снята с продажи в прошлом месяце после неудачного запуска. В сообщении для сотрудников PlayStation Хермен Хульст, генеральный директор группы студий PlayStation, говорит, что Firewalk Studios будет закрыта вместе со студией мобильных игр Neon Koi.",
      "content": "\"Мы потратили много времени в последние несколько месяцев, изучая все возможные варианты. После долгих размышлений мы пришли к выводу, что лучшим вариантом будет окончательный закат игры и закрытие студии. Я хочу поблагодарить всех сотрудников Firewalk за их мастерство, творческий дух и преданность делу.\"\r\n\r\nПо словам Хульста, Concord не достиг поставленных Sony целей, и производитель PlayStation «учтет уроки, извлеченные из Concord, и продолжит развивать наши возможности живого сервиса, чтобы обеспечить будущий рост в этой области».\r\n\r\nДебют Concord состоялся 23 августа на PS5 и ПК, но 6 сентября Sony закрыла игру после низких продаж. По оценкам, продажи составили менее 25 000 человек, а в Steam Concord набрал всего 697 игроков, что ниже, чем у провальной The Lord of the Rings: Gollum",
      "pub_date": "2024-10-22T21:00:00Z",
      "views": 36,
      "status": "published",
      "image": "news_images/JVH-8HcjAsG1NOqasvYqIw.jpeg.webp",
      "author": 1,
      "notified": true,
      "tags": [21, 42]
    }
  },
  {
    "model": "news.news",
    "pk": 27,
    "fields": {
      "title": "Бывший исполнительный директор Disney: Голливуд находится в кризисе из-за BlackRock и их DEI-требований",
      "brief": "У бывшего исполнительного директора Walt Disney Television Моники Харрис состоялось интервью, в котором она рассказала о причинах кризиса в Голливуде. Она возложила вину за низкое качество фильмов в последние годы непосредственно на DEI-инициативы, которых обязывают придерживаться студии при создании фильма!",
      "content": "Основная причина в том, что компании производят медиапродукты, которые явно не нравятся потребителям. Когда вы делаете медиапродукт для меньшинств - вы не имеете ничего общего с вашей аудиторией и ее вкусами.\r\n\r\nВ корпоративном мире наблюдается скрупулезная и рабская приверженность принципам ESG (экологического социального управления), которые на практике являются тем же самым DEI, в медиапродуктах и при приеме на работу.\r\n\r\nТаким образом, корпорации придерживаются маркетинговой тактики, которая изначально обречена на провал - в итоге фильмы действительно проваливаются, это снижает акционерную стоимость, но, тем не менее, они продолжают это делать.\r\n\r\nЭто происходит потому что одна и та же основная группа компаний (BlackRock, Vanguard, State Street) в основном финансирует или сидит в совете директоров/имеет мажоритарные пакеты акций в компаниях из списка Fortune 500 и в S&P 500.\r\n\r\nХаррис подтвердила то, о чем пользователи догадывались ранее: крупные корпорации, такие как BlackRock, действительно целиком и полностью контролируют большинство выпускаемых медиапродуктов, указывая компаниям что именно они должны делать и какие темы должны продвигать при их создании, будь-то игра или фильм:\r\n\r\n\"Когда эти три компании и их дочерние компании заседают в советах директоров и контролируют владение акциями, они в буквальном смысле могут приказывать им придерживаться любых рекомендаций, которые они пожелают. Если DEI - это инициатива, которую эти мажоритарные акционеры хотели бы, чтобы компании продвигали, то они будут это продвигать. Потому что в противном случае они столкнутся с гневом людей, которые могут забрать у них деньги, забрать кредиты, забрать финансирование - всё дело в деньгах.\r\n\r\nЭто происходит и в Голливуде. DEI пронеслась по киноиндустрии. На церемонии вручения премии \"Оскар\" номинации доступны только фильмам, которые достигли определенных квот, верно? У вас должно быть определенное количество чернокожих или бипок, трансгендеров, небинарных людей, кого угодно. Это полная противоположность тому, что представляет собой художественная работа.\"",
      "pub_date": "2024-10-18T09:00:00Z",
      "views": 0,
      "status": "published",
      "image": "news_images/kVLWkUC1W8sTYjipQdjKvQ.png.webp",
      "author": 1,
      "notified": true,
      "tags": [13, 60]
    }
  },
  {
    "model": "news.news",
    "pk": 28,
    "fields": {
      "title": "В сеть слили скриншоты раннего билда хоррора Cronos: The New Dawn и подробности геймплея Gutsz Gutsz",
      "brief": "Не так давно авторитетный инсайдер под ником Lunatic Ignus раскрыл первые подробности о предстоящей игре от польской студии Bloober Team, рассказав о локациях и уровне сложности в Cronos: The New Dawn.",
      "content": "Но на этом утечки не закончились — теперь в открытом доступе появились скриншоты из раннего билда игры и более детальное описание геймплея. Всё из-за того, что кто-то случайно опубликовал в сеть внутреннюю документацию с подробным описанием проекта.\r\n\r\nСообщается, что скриншоты взяты из раннего билда игры, когда в Bloober Team тестировали боевую систему и создавали структуру локаций. С тех пор разработка игры продвинулась значительно дальше. Из утечки стало известно, что в Cronos: The New Dawn будет 17 обязательных областей для исследования и 5 дополнительных территорий, связанных между собой.\r\n\r\nГеймплей Cronos: The New Dawn основан на перемещениях во времени между прошлым и будущим через загадочные аномалии. В будущем у игрока будет собственное место для отдыха, где можно заниматься улучшениями. По мере прохождения игры будущее будет открывать новые территории для исследования. В прошлое игрок будет отправляться на линейные локации, чтобы собирать души определенных персонажей и сражаться с врагами. Также подтверждено наличие нескольких концовок, причём некоторые из них будут труднодостижимыми.\r\n\r\nРелиз Cronos: The New Dawn запланирован на 2025 год для ПК, PlayStation 5 и Xbox Series X|S.",
      "pub_date": "2024-10-20T09:00:00Z",
      "views": 420,
      "status": "published",
      "image": "news_images/r1EnudWDP1RoNinXIZe__w.png.webp",
      "author": 1,
      "notified": true,
      "tags": [4, 21, 42, 48, 60]
    }
  },
  {
    "model": "news.news",
    "pk": 29,
    "fields": {
      "title": "Red Dead Redemption стартовала с 93% положительных отзывов и 2-го места в списке бестселлеров Steam",
      "brief": "Red Dead Redemption наконец-то вышла на ПК, и эта классическая игра Rockstar может похвастаться неплохим количеством игроков и положительными отзывами. Популярность первоначально выпущенной в 2010 году Red Dead Redemption до сих пор не падает, и фанаты жаждут снова испытать этот приключенческий боевик.",
      "content": "Всего через несколько часов после запуска игры в Steam она привлекла более 8 697 одновременных игроков, обойдя по этому показателю Sonic X Shadow Generations, God of War Ragnarok и Starfield за сутки. Отзывы также в основном положительные (93%), многие игроки хвалят технические аспекты порта, отмечая, что игра по-прежнему сохраняет свой оригинальный дух, несмотря на некоторые графические обновления.\r\n\r\nСтоит отметить, что Red Dead Redemption также забралась на второе место в списке платных бестселлеров Steam, уступив только Call of Duty: Black Ops 6.",
      "pub_date": "2024-10-14T15:28:14Z",
      "views": 780,
      "status": "published",
      "image": "news_images/PQodV3UQ2wKCYst-8XrEHg.jpeg.webp",
      "author": 1,
      "notified": true,
      "tags": [21, 42, 48, 60]
    }
  }
]
